num_layers: 122
quant_type: SYMMETRIC
calib_type: PERTENSOR
layers {
  layer_name: "input"
  layer_type: "TIDL_DataLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 255
    size: 1
    element_type: 6
    scale: 1
    zero_point: 0
  }
}
layers {
  layer_name: "input_netFormat"
  layer_type: "TIDL_DataConvertLayer"
  bit_depth: 4
  outputs {
    min: 0
    max: 254.994934
    size: 1
    element_type: 3
    scale: 128
    zero_point: 0
  }
}
layers {
  layer_name: "1"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: -47.0024071
    max: 46.7257156
    size: 1
    element_type: 3
    scale: 578.1297607421875
    zero_point: 0
  }
  weights {
    min: -0.110701792
    max: 0.102874942
    size: 1
    element_type: 3
    scale: 296002.4375
    zero_point: 0
  }
  bias {
    min: -2.69754219
    max: 3.49230576
    size: 12
    element_type: 0
    scale: 9382.9130859375
    zero_point: 0
    value: 0.75651401281356812
    value: -0.48455026745796204
    value: -0.8443865180015564
    value: 0.52185863256454468
    value: -2.6975421905517578
    value: 0.779502809047699
    value: -0.22196044027805328
    value: 2.5043942928314209
    value: 0.34621372818946838
    value: 3.4923057556152344
    value: -1.32000732421875
    value: -0.538902997970581
  }
}
layers {
  layer_name: "3"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 36.04879
    size: 1
    element_type: 2
    scale: 1684.84228515625
    zero_point: 0
  }
  weights {
    min: -0.686271667
    max: 0.512901127
    size: 1
    element_type: 3
    scale: 47747.85546875
    zero_point: 0
  }
  bias {
    min: -1.22700834
    max: 2.85252357
    size: 32
    element_type: 0
    scale: 11487.3720703125
    zero_point: 0
    value: 1.0562466382980347
    value: -0.10796229541301727
    value: -0.34342387318611145
    value: 0.94069021940231323
    value: -0.10197383165359497
    value: 0.60502171516418457
    value: -0.17931833863258362
    value: -0.0892808809876442
    value: -0.49876073002815247
    value: 0.63725870847702026
    value: -0.19964824616909027
    value: -0.19373445212841034
    value: 0.32145610451698303
    value: 0.78245252370834351
    value: 0.23451487720012665
    value: 0.043155688792467117
    value: -0.0094451270997524261
    value: -1.22700834274292
    value: -0.28026184439659119
    value: 0.60384351015090942
    value: 2.8525235652923584
    value: 0.86500203609466553
    value: -0.31081852316856384
    value: 2.1637647151947021
    value: 1.3673092126846313
    value: 0.51818674802780151
    value: -0.10926736891269684
    value: -0.21063299477100372
    value: -0.014508710242807865
    value: 1.3840535879135132
    value: -0.017365880310535431
    value: -0.40588104724884033
  }
}
layers {
  layer_name: "5"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 22.9689236
    size: 1
    element_type: 2
    scale: 1818.0494384765625
    zero_point: 0
  }
  weights {
    min: -0.463365346
    max: 0.330036819
    size: 1
    element_type: 3
    scale: 70717.4140625
    zero_point: 0
  }
  bias {
    min: -2.95389366
    max: 3.24187064
    size: 64
    element_type: 0
    scale: 10107.744140625
    zero_point: 0
    value: 0.064413554966449738
    value: 0.86731123924255371
    value: 2.5389280319213867
    value: 1.3283405303955078
    value: 2.1527554988861084
    value: 0.12802332639694214
    value: 1.8189500570297241
    value: 1.1989700794219971
    value: 0.66815304756164551
    value: 1.9618217945098877
    value: 1.5109338760375977
    value: 0.48936811089515686
    value: 0.81844741106033325
    value: 0.98206800222396851
    value: 0.062972322106361389
    value: -0.77944791316986084
    value: 0.90372079610824585
    value: 0.747593879699707
    value: -0.0903773233294487
    value: -0.18238572776317596
    value: 1.3970828056335449
    value: 1.1120673418045044
    value: -0.56943207979202271
    value: -0.21874263882637024
    value: -0.30363517999649048
    value: -0.74547743797302246
    value: -1.0282173156738281
    value: 0.11138830333948135
    value: -2.9538936614990234
    value: 0.28596585988998413
    value: -0.43368840217590332
    value: -0.35257318615913391
    value: -0.24132342636585236
    value: 0.891157329082489
    value: 2.8616433143615723
    value: 0.41623300313949585
    value: 0.97624224424362183
    value: -0.32475805282592773
    value: 0.044929612427949905
    value: 0.52599722146987915
    value: 0.00020980750559829175
    value: 3.241870641708374
    value: 0.14646288752555847
    value: 2.3830046653747559
    value: -0.541548490524292
    value: 0.73267793655395508
    value: 0.25434181094169617
    value: -0.047999132424592972
    value: -0.42272397875785828
    value: -0.1286635547876358
    value: 0.83989149332046509
    value: 0.88905072212219238
    value: 0.066817924380302429
    value: 0.36836102604866028
    value: -0.39865764975547791
    value: 0.8820185661315918
    value: -0.62699580192565918
    value: -0.03596651554107666
    value: 0.15042410790920258
    value: 0.43377569317817688
    value: 0.55292797088623047
    value: 0.12588821351528168
    value: 1.406602144241333
    value: 1.0086359977722168
  }
}
layers {
  layer_name: "7"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 12.3843765
    size: 1
    element_type: 2
    scale: 2879.84326171875
    zero_point: 0
  }
  weights {
    min: -1.26260304
    max: 0.681227326
    size: 1
    element_type: 3
    scale: 25952.732421875
    zero_point: 0
  }
  bias {
    min: -0.639265895
    max: 3.55991673
    size: 32
    element_type: 0
    scale: 9204.7099609375
    zero_point: 0
    value: 1.7010377645492554
    value: 0.71620148420333862
    value: 2.5708107948303223
    value: -0.022451337426900864
    value: 0.6334221363067627
    value: -0.63926589488983154
    value: -0.15301963686943054
    value: 0.34183019399642944
    value: 0.91894388198852539
    value: 1.2367185354232788
    value: -0.010001570917665958
    value: 0.21370978653430939
    value: 2.2899789810180664
    value: -0.47560197114944458
    value: 0.93520456552505493
    value: -0.16877225041389465
    value: 1.0816733837127686
    value: 1.7814499139785767
    value: -0.18323081731796265
    value: 1.5903936624526978
    value: 1.1586233377456665
    value: 0.15910311043262482
    value: 2.37530517578125
    value: 1.6721490621566772
    value: 0.27504831552505493
    value: 1.939175009727478
    value: 0.02519831620156765
    value: 1.5104795694351196
    value: 1.016055703163147
    value: 3.5599167346954346
    value: -0.0512508861720562
    value: 0.77556067705154419
  }
}
layers {
  layer_name: "9"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 7.9560771
    size: 1
    element_type: 2
    scale: 6282.17333984375
    zero_point: 0
  }
  weights {
    min: -0.578796327
    max: 0.484187245
    size: 1
    element_type: 3
    scale: 56614.04296875
    zero_point: 0
  }
  bias {
    min: -0.406207
    max: 2.74359775
    size: 32
    element_type: 0
    scale: 11943.44140625
    zero_point: 0
    value: 0.42906603217124939
    value: 1.2567986249923706
    value: 1.7419180870056152
    value: 0.78448653221130371
    value: 1.0214719772338867
    value: -0.40620699524879456
    value: 1.4320738315582275
    value: 1.0076580047607422
    value: 0.57023000717163086
    value: 1.7033892869949341
    value: 1.7460488080978394
    value: 0.19444277882575989
    value: 0.66426247358322144
    value: 0.44915929436683655
    value: 0.97647744417190552
    value: 0.30162528157234192
    value: 0.89618045091629028
    value: -0.034956041723489761
    value: 0.93607532978057861
    value: 0.17939479649066925
    value: 1.0424540042877197
    value: 2.116816520690918
    value: -0.34591779112815857
    value: 1.3090517520904541
    value: 0.91686397790908813
    value: 1.4430046081542969
    value: 0.8605533242225647
    value: 2.37197208404541
    value: 0.69009190797805786
    value: 0.77846163511276245
    value: 2.7435977458953857
    value: 1.0832300186157227
  }
}
layers {
  layer_name: "11"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 11.7077007
    size: 1
    element_type: 2
    scale: 4031.64013671875
    zero_point: 0
  }
  weights {
    min: -1.10037935
    max: 1.55821788
    size: 1
    element_type: 3
    scale: 21029.15234375
    zero_point: 0
  }
  bias {
    min: -2.89042306
    max: 5.02314568
    size: 32
    element_type: 0
    scale: 6523.40234375
    zero_point: 0
    value: 4.0558371543884277
    value: 3.4881510734558105
    value: 0.62030708789825439
    value: -0.84471482038497925
    value: 1.8084903955459595
    value: 0.15822148323059082
    value: 1.3822304010391235
    value: 1.0400295257568359
    value: -1.8824406862258911
    value: 3.2424094676971436
    value: -1.3323472738265991
    value: 3.6735496520996094
    value: -2.2643842697143555
    value: 1.17304527759552
    value: 2.5707838535308838
    value: -1.3766285181045532
    value: 0.51806306838989258
    value: -2.890423059463501
    value: 0.042254045605659485
    value: -0.39162260293960571
    value: 0.49736955761909485
    value: 1.4151331186294556
    value: 5.02314567565918
    value: 1.7902932167053223
    value: 2.1209166049957275
    value: -0.16854280233383179
    value: -1.1413359642028809
    value: 1.7214164733886719
    value: -0.053472809493541718
    value: 2.815873384475708
    value: -0.83995723724365234
    value: 1.2542794942855835
  }
}
layers {
  layer_name: "13"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 12.2787933
    size: 1
    element_type: 2
    scale: 3310.58349609375
    zero_point: 0
  }
  weights {
    min: -1.21780348
    max: 0.724443913
    size: 1
    element_type: 3
    scale: 26907.4609375
    zero_point: 0
  }
  bias {
    min: -1.72046971
    max: 6.81542444
    size: 32
    element_type: 0
    scale: 4807.91796875
    zero_point: 0
    value: 0.36496427655220032
    value: -0.70206952095031738
    value: -0.21801663935184479
    value: 0.18443238735198975
    value: -0.7693212628364563
    value: 2.0003783702850342
    value: -0.29052308201789856
    value: 2.6139171123504639
    value: 3.0637714862823486
    value: -0.44730415940284729
    value: -0.085858851671218872
    value: 0.42860910296440125
    value: -1.7204697132110596
    value: 0.63034451007843018
    value: 1.4295791387557983
    value: 1.5679218769073486
    value: 0.56206595897674561
    value: -0.040668845176696777
    value: 0.47982844710350037
    value: 2.3003804683685303
    value: 1.141721248626709
    value: 6.81542444229126
    value: -0.91362911462783813
    value: 1.8318641185760498
    value: 1.7569798231124878
    value: 1.9647992849349976
    value: 1.2501212358474731
    value: 1.0839940309524536
    value: -0.91050869226455688
    value: -0.72216182947158813
    value: 3.9739611148834229
    value: -0.522371768951416
  }
}
layers {
  layer_name: "14"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 15.1654387
    size: 1
    element_type: 2
    scale: 3310.58349609375
    zero_point: 0
  }
}
layers {
  layer_name: "15"
  layer_type: "TIDL_ConcatLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 15.2442989
    size: 1
    element_type: 2
    scale: 2879.84326171875
    zero_point: 0
  }
}
layers {
  layer_name: "17"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 12.8596773
    size: 1
    element_type: 2
    scale: 4568.84423828125
    zero_point: 0
  }
  weights {
    min: -0.928610325
    max: 1.26064408
    size: 1
    element_type: 3
    scale: 25993.0625
    zero_point: 0
  }
  bias {
    min: -1.85016119
    max: 6.53544
    size: 64
    element_type: 0
    scale: 5013.8935546875
    zero_point: 0
    value: 2.8116867542266846
    value: 2.9198324680328369
    value: 0.0559011772274971
    value: 0.97520124912261963
    value: 3.3106954097747803
    value: 4.10561466217041
    value: 1.5981016159057617
    value: 0.79650580883026123
    value: 0.94922184944152832
    value: -1.2782330513000488
    value: 0.37485140562057495
    value: 1.3240509033203125
    value: -1.0321532487869263
    value: -0.79090452194213867
    value: 0.83802157640457153
    value: 2.0081462860107422
    value: -0.45884871482849121
    value: 2.1163420677185059
    value: 0.0466027706861496
    value: 0.91184020042419434
    value: 0.30864053964614868
    value: 0.064474917948246
    value: 0.075199387967586517
    value: 2.1837813854217529
    value: 0.62559968233108521
    value: 3.6128695011138916
    value: 2.6962263584136963
    value: 0.59582829475402832
    value: 1.9113869667053223
    value: -0.0454883798956871
    value: 0.59464091062545776
    value: 2.5040380954742432
    value: 1.9957644939422607
    value: 1.8337382078170776
    value: -0.68373793363571167
    value: 1.3250043392181396
    value: 0.87129789590835571
    value: 2.9579195976257324
    value: 1.7343727350234985
    value: 1.844032883644104
    value: 1.184313178062439
    value: 2.4345176219940186
    value: 1.904812216758728
    value: 1.5733462572097778
    value: 0.023850882425904274
    value: -0.571480393409729
    value: 2.6304218769073486
    value: 6.5354399681091309
    value: -1.1856081485748291
    value: 2.2039852142333984
    value: -0.046771861612796783
    value: 4.1353530883789062
    value: 2.0109140872955322
    value: 0.549541175365448
    value: 1.9498153924942017
    value: -0.39339450001716614
    value: 2.8132827281951904
    value: 0.87606221437454224
    value: 2.4441063404083252
    value: 0.18079470098018646
    value: -1.8501611948013306
    value: 1.4268467426300049
    value: 0.67542940378189087
    value: 3.6706521511077881
  }
}
layers {
  layer_name: "19"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 11.3975878
    size: 1
    element_type: 2
    scale: 3163.973388671875
    zero_point: 0
  }
  weights {
    min: -0.361005276
    max: 0.329062968
    size: 1
    element_type: 3
    scale: 90768.7578125
    zero_point: 0
  }
  bias {
    min: -1.71099925
    max: 1.88089919
    size: 128
    element_type: 0
    scale: 17421.455078125
    zero_point: 0
    value: 0.54710131883621216
    value: 0.30068302154541016
    value: 0.23482918739318848
    value: 0.43307280540466309
    value: 0.45107319951057434
    value: 0.43735790252685547
    value: 1.0519335269927979
    value: 1.8559319972991943
    value: 0.17750629782676697
    value: 0.16998334228992462
    value: 0.09849858283996582
    value: 0.25038585066795349
    value: 1.1564218997955322
    value: -1.3931447267532349
    value: 0.17622993886470795
    value: -0.21999354660511017
    value: 0.4845736026763916
    value: 0.65614485740661621
    value: 0.69646412134170532
    value: -1.2510484457015991
    value: 1.1269329786300659
    value: 1.0745896100997925
    value: 0.322451651096344
    value: 1.0866134166717529
    value: 1.3141624927520752
    value: 1.0506795644760132
    value: 1.1776019334793091
    value: 1.141876220703125
    value: 0.21011519432067871
    value: 0.74793875217437744
    value: -0.24326331913471222
    value: -0.53285747766494751
    value: -1.1433695554733276
    value: 0.75179511308670044
    value: 0.11599814891815186
    value: -0.26434803009033203
    value: -0.11337543278932571
    value: 0.59309673309326172
    value: -0.57412797212600708
    value: -0.16942419111728668
    value: 0.45446214079856873
    value: 0.24040889739990234
    value: 1.6681091785430908
    value: -0.03200090304017067
    value: -0.905622124671936
    value: -0.080097869038581848
    value: -0.097208574414253235
    value: -0.17568695545196533
    value: 0.12271246314048767
    value: 1.2420247793197632
    value: -0.42948028445243835
    value: 0.96316379308700562
    value: 0.090097993612289429
    value: 0.31855738162994385
    value: 1.2329251766204834
    value: 1.276508092880249
    value: -0.34146919846534729
    value: 0.045967593789100647
    value: 0.78332346677780151
    value: -1.2940999269485474
    value: 0.373196542263031
    value: 1.2545158863067627
    value: 0.97168117761611938
    value: 0.87741333246231079
    value: 0.78665316104888916
    value: 0.4171602725982666
    value: 0.43023607134819031
    value: -0.13556703925132751
    value: 0.017527582123875618
    value: 0.50668478012084961
    value: -1.7109992504119873
    value: -0.098510853946208954
    value: -0.32225623726844788
    value: 0.6061895489692688
    value: -0.044548626989126205
    value: 0.48484835028648376
    value: -0.35069835186004639
    value: 0.92066085338592529
    value: 0.041093889623880386
    value: -0.32032674551010132
    value: 0.026466390118002892
    value: 0.19609522819519043
    value: 0.1357424259185791
    value: 0.2940981388092041
    value: 0.7041085958480835
    value: 1.6918700933456421
    value: 0.66464745998382568
    value: -0.090438097715377808
    value: 1.88089919090271
    value: -0.304836243391037
    value: -0.690518856048584
    value: 0.33617612719535828
    value: -0.45373818278312683
    value: 0.56303310394287109
    value: 0.78824430704116821
    value: 0.31824034452438354
    value: 0.593938946723938
    value: -1.0043261051177979
    value: 0.60154932737350464
    value: 0.78496474027633667
    value: 0.39600419998168945
    value: 1.175506591796875
    value: 0.45226031541824341
    value: 0.22464217245578766
    value: -0.074763774871826172
    value: 0.033970236778259277
    value: 0.12909603118896484
    value: -0.2429436594247818
    value: 0.26660618185997009
    value: 1.6181902885437012
    value: 0.24416744709014893
    value: 1.3724825382232666
    value: 0.81819486618041992
    value: 0.83333379030227661
    value: 0.93362051248550415
    value: 1.5362316370010376
    value: 0.858506977558136
    value: 1.3892358541488647
    value: 1.0283528566360474
    value: 1.48515784740448
    value: -0.27783298492431641
    value: 0.6457369327545166
    value: -0.764502227306366
    value: 0.34606310725212097
    value: -0.0359850749373436
    value: 0.20321185886859894
    value: -0.500346839427948
    value: 1.4371848106384277
  }
}
layers {
  layer_name: "21"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 16.5110188
    size: 1
    element_type: 2
    scale: 2699.797607421875
    zero_point: 0
  }
  weights {
    min: -1.17192984
    max: 1.16132677
    size: 1
    element_type: 3
    scale: 27960.71875
    zero_point: 0
  }
  bias {
    min: -5.07259178
    max: 3.78516126
    size: 64
    element_type: 0
    scale: 6459.81396484375
    zero_point: 0
    value: -2.9266667366027832
    value: -0.59993934631347656
    value: 1.8631116151809692
    value: 1.0596146583557129
    value: -1.7454379796981812
    value: 1.7087594270706177
    value: 0.82547056674957275
    value: -1.8213639259338379
    value: 0.77221739292144775
    value: 0.72642320394515991
    value: 0.33964246511459351
    value: 1.057570219039917
    value: 0.51920145750045776
    value: -1.3537489175796509
    value: 2.5791282653808594
    value: -0.21972672641277313
    value: 3.2177252769470215
    value: -0.28728145360946655
    value: -0.14966417849063873
    value: 0.087580315768718719
    value: -1.4589197635650635
    value: -0.56517022848129272
    value: 0.92904043197631836
    value: 1.0394259691238403
    value: -1.7937139272689819
    value: 1.5152201652526855
    value: -0.47485226392745972
    value: 0.18750405311584473
    value: 0.30585014820098877
    value: 0.47083041071891785
    value: 0.013422851450741291
    value: 0.60100001096725464
    value: -0.29774340987205505
    value: 0.025665128603577614
    value: 0.69308739900588989
    value: 0.89593297243118286
    value: 2.1226596832275391
    value: 0.85947483777999878
    value: 1.176073431968689
    value: -0.6109769344329834
    value: 0.19511322677135468
    value: 0.85094332695007324
    value: 1.6185493469238281
    value: -0.22672449052333832
    value: 2.4347574710845947
    value: 0.93420815467834473
    value: -0.72862356901168823
    value: 3.7851612567901611
    value: 0.011462369933724403
    value: 1.7080825567245483
    value: -0.076924063265323639
    value: -5.0725917816162109
    value: 0.29721599817276
    value: -1.0145094394683838
    value: 0.60865294933319092
    value: 0.27339339256286621
    value: 2.1711094379425049
    value: 1.2381212711334229
    value: 2.448204517364502
    value: 0.62910282611846924
    value: 0.69634908437728882
    value: 0.059489909559488297
    value: -1.306840181350708
    value: -0.014253631234169006
  }
}
layers {
  layer_name: "23"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 5.55502796
    size: 1
    element_type: 2
    scale: 7081.90087890625
    zero_point: 0
  }
  weights {
    min: -0.279951751
    max: 0.446768939
    size: 1
    element_type: 3
    scale: 73344.3984375
    zero_point: 0
  }
  bias {
    min: -0.87026161
    max: 2.53273296
    size: 64
    element_type: 0
    scale: 12937.802734375
    zero_point: 0
    value: 0.19390349090099335
    value: 0.82419753074646
    value: 0.23120744526386261
    value: -0.407999187707901
    value: 0.46613976359367371
    value: -0.039826471358537674
    value: 1.1921640634536743
    value: 1.4064042568206787
    value: 1.4747569561004639
    value: 1.4970676898956299
    value: 0.836293637752533
    value: 1.3371909856796265
    value: 0.96843290328979492
    value: 1.1142162084579468
    value: -0.23269000649452209
    value: 0.27983132004737854
    value: 1.0680787563323975
    value: 0.81987476348876953
    value: 0.68771266937255859
    value: 0.24244080483913422
    value: 0.70442259311676025
    value: -0.49868127703666687
    value: 0.62527596950531006
    value: 0.048745468258857727
    value: -0.23534476757049561
    value: 0.90248209238052368
    value: 0.58593940734863281
    value: 0.78058087825775146
    value: 0.03980289027094841
    value: -0.18051335215568542
    value: 1.7923892736434937
    value: 0.91484177112579346
    value: 0.080128036439418793
    value: 0.53126657009124756
    value: 1.1355955600738525
    value: 0.26823893189430237
    value: 0.98156344890594482
    value: 0.42511269450187683
    value: 0.61822319030761719
    value: 2.5327329635620117
    value: -0.53419733047485352
    value: 0.521847128868103
    value: 1.0178228616714478
    value: 0.19473882019519806
    value: 1.9221467971801758
    value: 1.908461332321167
    value: -0.87026160955429077
    value: 1.7397143840789795
    value: 0.72674089670181274
    value: 0.12909288704395294
    value: 0.49924769997596741
    value: 0.86045444011688232
    value: 0.28579023480415344
    value: 0.506048858165741
    value: -0.13956731557846069
    value: 0.15927162766456604
    value: 0.94761025905609131
    value: 1.0558679103851318
    value: 1.050834059715271
    value: 1.7824563980102539
    value: 0.286431223154068
    value: -0.10902230441570282
    value: 1.8162226676940918
    value: 0.29498347640037537
  }
}
layers {
  layer_name: "25"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 8.08355141
    size: 1
    element_type: 2
    scale: 3221.67919921875
    zero_point: 0
  }
  weights {
    min: -0.997571111
    max: 1.09910095
    size: 1
    element_type: 3
    scale: 29813.458984375
    zero_point: 0
  }
  bias {
    min: -4.18671
    max: 4.05705881
    size: 64
    element_type: 0
    scale: 7826.6708984375
    zero_point: 0
    value: 0.84922873973846436
    value: -0.0681503638625145
    value: 0.95345395803451538
    value: -0.29100537300109863
    value: -0.099973753094673157
    value: 0.18940688669681549
    value: 1.1557276248931885
    value: -1.2285029888153076
    value: -1.3912146091461182
    value: -0.48829984664916992
    value: 2.3643331527709961
    value: 0.66657930612564087
    value: 1.2846575975418091
    value: 0.11046495288610458
    value: -0.58618539571762085
    value: -1.1921340227127075
    value: 0.059139098972082138
    value: -0.49876329302787781
    value: 4.0570588111877441
    value: -3.990598201751709
    value: -0.23751829564571381
    value: 1.0238504409790039
    value: 2.2529635429382324
    value: 1.5711232423782349
    value: -2.3108274936676025
    value: 1.2905396223068237
    value: 0.14175790548324585
    value: -2.0754134654998779
    value: 1.2232016324996948
    value: -4.1867098808288574
    value: 1.5716273784637451
    value: -2.6524026393890381
    value: 1.2641727924346924
    value: 0.67643117904663086
    value: 1.2154691219329834
    value: 0.12519653141498566
    value: -1.3952924013137817
    value: 2.8612263202667236
    value: -3.0483536720275879
    value: -1.099247932434082
    value: 0.05578189343214035
    value: 2.8889079093933105
    value: 2.0247931480407715
    value: 0.12734644114971161
    value: 0.34575709700584412
    value: -3.0312337875366211
    value: 0.87806355953216553
    value: -0.789019763469696
    value: 3.0292096138000488
    value: -1.4994450807571411
    value: 1.2280505895614624
    value: 1.2383869886398315
    value: 1.38787043094635
    value: 1.3831769227981567
    value: -0.58249187469482422
    value: -1.9559303522109985
    value: -1.0690642595291138
    value: 1.3292371034622192
    value: -1.7254806756973267
    value: 1.7587124109268188
    value: 1.8400577306747437
    value: -0.97279614210128784
    value: -1.7584713697433472
    value: 0.48347082734107971
  }
}
layers {
  layer_name: "27"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 5.16312933
    size: 1
    element_type: 2
    scale: 10016.7861328125
    zero_point: 0
  }
  weights {
    min: -0.236078545
    max: 0.321628
    size: 1
    element_type: 3
    scale: 101881.671875
    zero_point: 0
  }
  bias {
    min: -1.013327
    max: 2.95302248
    size: 64
    element_type: 0
    scale: 11096.427734375
    zero_point: 0
    value: -0.18694959580898285
    value: 0.268146812915802
    value: 0.21114106476306915
    value: -0.5395163893699646
    value: -0.54319727420806885
    value: 0.40869298577308655
    value: 0.19462756812572479
    value: -0.52021026611328125
    value: 0.14358292520046234
    value: 0.53362882137298584
    value: -0.11100752651691437
    value: 0.1152605339884758
    value: -0.062069334089756012
    value: 0.79552018642425537
    value: -0.5713961124420166
    value: 0.29021728038787842
    value: -0.26090055704116821
    value: -0.080181807279586792
    value: 0.033209338784217834
    value: -0.62382155656814575
    value: -0.71918958425521851
    value: -0.59347891807556152
    value: 0.21477074921131134
    value: 0.20070894062519073
    value: 0.27500537037849426
    value: 0.73803645372390747
    value: -0.28568562865257263
    value: -0.832885205745697
    value: 0.12279630452394485
    value: 0.052128329873085022
    value: -0.670402467250824
    value: 0.92440712451934814
    value: 0.58850687742233276
    value: -0.242627814412117
    value: -0.38052380084991455
    value: 0.789828896522522
    value: -0.500755250453949
    value: -0.27434492111206055
    value: -0.0782071202993393
    value: 0.23661208152770996
    value: -0.35398757457733154
    value: -0.060435660183429718
    value: -0.22229301929473877
    value: 0.25221222639083862
    value: -0.24022300541400909
    value: 0.23310935497283936
    value: -0.40357649326324463
    value: 2.9530224800109863
    value: 0.97397798299789429
    value: -0.38736763596534729
    value: -0.2310667484998703
    value: 0.31454953551292419
    value: 0.23163054883480072
    value: -0.068111561238765717
    value: 0.26047971844673157
    value: -0.13186509907245636
    value: -0.65709453821182251
    value: 0.55162239074707031
    value: -1.0133270025253296
    value: 0.17223913967609406
    value: -0.23269380629062653
    value: -0.21188296377658844
    value: 0.22074694931507111
    value: 0.54012864828109741
  }
}
layers {
  layer_name: "28"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 7.54665327
    size: 1
    element_type: 2
    scale: 7081.90087890625
    zero_point: 0
  }
}
layers {
  layer_name: "30"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 8.0899992
    size: 1
    element_type: 2
    scale: 6630.80078125
    zero_point: 0
  }
  weights {
    min: -0.628020763
    max: 1.06803095
    size: 1
    element_type: 3
    scale: 30680.7578125
    zero_point: 0
  }
  bias {
    min: -2.65708733
    max: 4.2994647
    size: 64
    element_type: 0
    scale: 7621.4140625
    zero_point: 0
    value: 0.97901737689971924
    value: 1.4114123582839966
    value: 1.4329979419708252
    value: -0.58750277757644653
    value: -0.51207548379898071
    value: -1.4549180269241333
    value: 0.72445505857467651
    value: -0.76991122961044312
    value: -1.5219976902008057
    value: -1.967603325843811
    value: 3.4811220169067383
    value: -0.56773382425308228
    value: 0.65681183338165283
    value: -0.32193499803543091
    value: 0.41585159301757812
    value: 0.021653866395354271
    value: 2.5254497528076172
    value: 1.111919641494751
    value: -0.865079402923584
    value: 0.42871895432472229
    value: 1.1146788597106934
    value: -2.2943000793457031
    value: -0.74510520696640015
    value: 0.394867479801178
    value: 0.74569243192672729
    value: -0.25897112488746643
    value: 1.0939443111419678
    value: 2.1842877864837646
    value: -0.49048644304275513
    value: 1.3714152574539185
    value: 1.7292847633361816
    value: 4.2994647026062012
    value: -1.7853049039840698
    value: 2.3369007110595703
    value: -2.6570873260498047
    value: 0.687845766544342
    value: 2.545619010925293
    value: 1.65619695186615
    value: -2.4717772006988525
    value: 0.18703143298625946
    value: 1.2604312896728516
    value: -2.4277706146240234
    value: 2.5742604732513428
    value: -0.70943617820739746
    value: 1.39503812789917
    value: 0.38510927557945251
    value: 0.29225125908851624
    value: -2.0898075103759766
    value: 1.5154191255569458
    value: 2.3785691261291504
    value: -0.23667122423648834
    value: 1.1838970184326172
    value: -0.57765549421310425
    value: 2.6767416000366211
    value: -2.5437159538269043
    value: 0.92875921726226807
    value: 1.4235998392105103
    value: -0.12839250266551971
    value: 4.2007808685302734
    value: 0.34485659003257751
    value: 3.2379045486450195
    value: 1.29789400100708
    value: 3.3772108554840088
    value: -2.1541106700897217
  }
}
layers {
  layer_name: "32"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 7.99031115
    size: 1
    element_type: 2
    scale: 6257.3798828125
    zero_point: 0
  }
  weights {
    min: -0.338598043
    max: 0.529838443
    size: 1
    element_type: 3
    scale: 61845.265625
    zero_point: 0
  }
  bias {
    min: -1.1532042
    max: 2.40851569
    size: 64
    element_type: 0
    scale: 13605.0595703125
    zero_point: 0
    value: 1.1430960893630981
    value: 0.88411945104599
    value: 0.66897809505462646
    value: 0.21199466288089752
    value: 1.0789997577667236
    value: 0.20772591233253479
    value: 0.16732671856880188
    value: -0.95467180013656616
    value: 0.39731544256210327
    value: -0.33210182189941406
    value: 0.58564811944961548
    value: 0.29989802837371826
    value: -0.06426558643579483
    value: -0.77456694841384888
    value: -0.51730406284332275
    value: 0.99323785305023193
    value: 0.662841796875
    value: -0.07666536420583725
    value: -1.1532042026519775
    value: -0.14274589717388153
    value: -0.28578022122383118
    value: 0.21488738059997559
    value: -0.29740267992019653
    value: 0.26897570490837097
    value: -0.092345528304576874
    value: 0.714145302772522
    value: -0.20335099101066589
    value: 0.54773968458175659
    value: 0.58764451742172241
    value: -0.41436758637428284
    value: -0.00563545199111104
    value: 1.2085597515106201
    value: 0.56553632020950317
    value: 0.46423137187957764
    value: 0.43147292733192444
    value: 1.4140175580978394
    value: 0.22443936765193939
    value: 0.57468611001968384
    value: 0.08232831209897995
    value: 0.77874350547790527
    value: -0.027232050895690918
    value: 0.889419674873352
    value: 0.23613922297954559
    value: 1.1903336048126221
    value: 0.10821624100208282
    value: 1.0284481048583984
    value: -0.55004978179931641
    value: 2.4085156917572021
    value: -0.32484236359596252
    value: -0.62245428562164307
    value: -0.402951717376709
    value: -0.12395402044057846
    value: 0.11044075340032578
    value: -1.0648281574249268
    value: -0.09914996474981308
    value: -0.59126222133636475
    value: 0.35922381281852722
    value: 0.69757217168807983
    value: 0.30682176351547241
    value: 0.00046737719094380736
    value: 0.27330267429351807
    value: 0.062223870307207108
    value: 0.23877067863941193
    value: -0.85362553596496582
  }
}
layers {
  layer_name: "33"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 11.2696829
    size: 1
    element_type: 2
    scale: 3128.68994140625
    zero_point: 0
  }
}
layers {
  layer_name: "35"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 8.22446632
    size: 1
    element_type: 2
    scale: 2212.47314453125
    zero_point: 0
  }
  weights {
    min: -0.666756
    max: 0.707057118
    size: 1
    element_type: 3
    scale: 46344.203125
    zero_point: 0
  }
  bias {
    min: -2.43527126
    max: 3.59661222
    size: 64
    element_type: 0
    scale: 9110.7958984375
    zero_point: 0
    value: -1.6029151678085327
    value: 1.681401252746582
    value: 0.79108291864395142
    value: -1.1593087911605835
    value: 0.547781765460968
    value: 0.036874830722808838
    value: 0.72052246332168579
    value: 0.91863638162612915
    value: -0.49013793468475342
    value: -2.4352712631225586
    value: -0.042309898883104324
    value: 1.1162563562393188
    value: 1.5036571025848389
    value: -0.58604931831359863
    value: -0.9838942289352417
    value: 1.0697312355041504
    value: 0.36748313903808594
    value: 3.5966122150421143
    value: 2.5480821132659912
    value: -1.0883103609085083
    value: -0.37794297933578491
    value: -1.7670782804489136
    value: 2.0768833160400391
    value: -1.7957334518432617
    value: -0.90002715587615967
    value: 0.67875361442565918
    value: 0.762588381767273
    value: 0.56661951541900635
    value: 2.1293234825134277
    value: 0.406521737575531
    value: -0.28866291046142578
    value: -1.050113320350647
    value: -0.24365247786045074
    value: -1.5451797246932983
    value: -0.061288915574550629
    value: -1.4651817083358765
    value: 2.1144695281982422
    value: 0.031558424234390259
    value: -0.22273190319538116
    value: -0.39660894870758057
    value: 1.7940815687179565
    value: -0.15527881681919098
    value: -1.5801377296447754
    value: 2.6297540664672852
    value: -0.43625587224960327
    value: 3.1124269962310791
    value: 0.88559341430664062
    value: -1.337823748588562
    value: 0.058986425399780273
    value: 0.48332780599594116
    value: -1.0166804790496826
    value: 1.2760062217712402
    value: 1.4453657865524292
    value: -1.1569929122924805
    value: -0.80638223886489868
    value: 3.282604455947876
    value: 2.8289003372192383
    value: -2.2848460674285889
    value: -0.6774824857711792
    value: 2.1738147735595703
    value: -1.126289963722229
    value: 1.1877552270889282
    value: -0.9585842490196228
    value: 0.26120033860206604
  }
}
layers {
  layer_name: "37"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 13.6959629
    size: 1
    element_type: 2
    scale: 4214.26220703125
    zero_point: 0
  }
  weights {
    min: -0.573152661
    max: 1.04999316
    size: 1
    element_type: 3
    scale: 31207.822265625
    zero_point: 0
  }
  bias {
    min: -1.76031089
    max: 7.78072739
    size: 64
    element_type: 0
    scale: 4211.431640625
    zero_point: 0
    value: 0.11340966075658798
    value: -0.095111876726150513
    value: 0.2636745274066925
    value: -0.24858178198337555
    value: 1.4452645778656006
    value: 1.1472439765930176
    value: -0.33502790331840515
    value: 1.514235258102417
    value: 0.407600462436676
    value: 0.099640399217605591
    value: -0.38145655393600464
    value: 0.028386011719703674
    value: 1.1388368606567383
    value: 0.46977362036705017
    value: -0.11236118525266647
    value: 1.0508975982666016
    value: 1.3324484825134277
    value: -0.54024595022201538
    value: 0.48226499557495117
    value: -0.56430763006210327
    value: -0.71653473377227783
    value: -0.19806341826915741
    value: 1.250022292137146
    value: -0.35677307844161987
    value: -0.47489923238754272
    value: 1.8835686445236206
    value: -0.67032855749130249
    value: 2.9949812889099121
    value: 1.0244724750518799
    value: 1.2164918184280396
    value: 0.54176098108291626
    value: 0.68913334608078
    value: 0.20899048447608948
    value: 0.31047260761260986
    value: -0.47655975818634033
    value: 0.14861984550952911
    value: -0.41375800967216492
    value: -0.37304767966270447
    value: 0.14096474647521973
    value: 2.5301806926727295
    value: -0.068581797182559967
    value: -1.3473740816116333
    value: 0.529051661491394
    value: 0.55373340845108032
    value: 0.10894918441772461
    value: 7.7807273864746094
    value: -0.067544452846050262
    value: 1.8309019804000854
    value: 0.43540006875991821
    value: 0.276767373085022
    value: 0.647773027420044
    value: -0.27884012460708618
    value: 1.0085763931274414
    value: -0.24113121628761292
    value: -0.8404659628868103
    value: -0.57696759700775146
    value: 0.27232173085212708
    value: 0.75372093915939331
    value: -0.76185506582260132
    value: -1.7603108882904053
    value: -1.1621917486190796
    value: 1.8344094753265381
    value: 0.39643612504005432
    value: 0.78786748647689819
  }
}
layers {
  layer_name: "38"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 16.8120899
    size: 1
    element_type: 2
    scale: 3128.68994140625
    zero_point: 0
  }
}
layers {
  layer_name: "39"
  layer_type: "TIDL_ConcatLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 18.607769
    size: 1
    element_type: 2
    scale: 2699.797607421875
    zero_point: 0
  }
}
layers {
  layer_name: "41"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 12.0890932
    size: 1
    element_type: 2
    scale: 4351.76318359375
    zero_point: 0
  }
  weights {
    min: -0.620391667
    max: 0.512780666
    size: 1
    element_type: 3
    scale: 52818.24609375
    zero_point: 0
  }
  bias {
    min: -2.57098222
    max: 4.39731169
    size: 128
    element_type: 0
    scale: 7451.82568359375
    zero_point: 0
    value: 0.58596211671829224
    value: 0.35492253303527832
    value: 0.457797646522522
    value: 1.5705522298812866
    value: 0.11952691525220871
    value: -0.18864786624908447
    value: 1.6878440380096436
    value: 0.4132516086101532
    value: 0.095069214701652527
    value: 1.5481216907501221
    value: 0.16326726973056793
    value: 0.19373513758182526
    value: 0.66962587833404541
    value: -0.1837739497423172
    value: 1.0747025012969971
    value: 2.0547599792480469
    value: 1.206616997718811
    value: -0.95888030529022217
    value: -1.0173251628875732
    value: 1.3391964435577393
    value: 0.63965505361557007
    value: 0.15301021933555603
    value: 1.5597196817398071
    value: 2.4802134037017822
    value: 1.2904629707336426
    value: 1.4418171644210815
    value: 0.47110867500305176
    value: 1.9897923469543457
    value: -0.78034186363220215
    value: 1.7370783090591431
    value: 0.41551804542541504
    value: 1.2267787456512451
    value: 0.24853819608688354
    value: 1.004757285118103
    value: -1.8179134130477905
    value: -0.43043667078018188
    value: 1.9650826454162598
    value: 2.0041468143463135
    value: 0.83758187294006348
    value: 1.0819578170776367
    value: -0.7741081714630127
    value: 0.34795898199081421
    value: -1.9365215301513672
    value: 0.89053946733474731
    value: 2.2700495719909668
    value: 0.82578247785568237
    value: 0.8805660605430603
    value: -0.029464012011885643
    value: 0.71989119052886963
    value: 0.091138847172260284
    value: 2.0635755062103271
    value: -0.9448925256729126
    value: -0.291327565908432
    value: -0.10286471992731094
    value: 1.2923219203948975
    value: 0.78646284341812134
    value: 0.53367155790328979
    value: 0.23246617615222931
    value: -0.33282968401908875
    value: 1.1003320217132568
    value: -0.771816611289978
    value: 1.5561988353729248
    value: 2.3361127376556396
    value: -1.0132392644882202
    value: -2.0722954273223877
    value: 0.65558481216430664
    value: 1.3272534608840942
    value: 1.5814507007598877
    value: -0.38192477822303772
    value: -0.014476194977760315
    value: 0.69384396076202393
    value: 0.385642945766449
    value: 1.0696197748184204
    value: -0.42203390598297119
    value: 0.49236726760864258
    value: -1.0999624729156494
    value: -1.3356412649154663
    value: 0.46176159381866455
    value: 0.24654850363731384
    value: -0.92605680227279663
    value: -2.5709822177886963
    value: -0.6319345235824585
    value: -1.5963066816329956
    value: 0.95119941234588623
    value: -8.0123584211833077e-07
    value: 1.2026772499084473
    value: 3.663851261138916
    value: 1.8945013284683228
    value: 0.21246494352817535
    value: -1.52715265750885
    value: 0.3785102367401123
    value: 1.2489542961120605
    value: 0.30161741375923157
    value: 1.6823536157608032
    value: 0.89153504371643066
    value: -0.04050678014755249
    value: 0.98492681980133057
    value: -1.1846522092819214
    value: -1.1099077463150024
    value: -0.15235216915607452
    value: -0.097349070012569427
    value: -1.0811429023742676
    value: -0.0404510535299778
    value: 4.3973116874694824
    value: -0.42570370435714722
    value: -0.38644230365753174
    value: 0.61869174242019653
    value: 2.1423637866973877
    value: 0.23207269608974457
    value: 1.3017586469650269
    value: -0.037077929824590683
    value: 0.34032559394836426
    value: 0.82443523406982422
    value: -0.7827715277671814
    value: -0.69196158647537231
    value: 0.43542766571044922
    value: -0.91190546751022339
    value: -0.21203571557998657
    value: 1.2751851081848145
    value: -1.475007176399231
    value: -0.22390373051166534
    value: -0.48731803894042969
    value: 0.25957933068275452
    value: 1.7551368474960327
    value: -2.1630947589874268
    value: -0.59658700227737427
    value: -0.19528448581695557
    value: 0.86524868011474609
  }
}
layers {
  layer_name: "43"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 9.37945
    size: 1
    element_type: 2
    scale: 2895.498779296875
    zero_point: 0
  }
  weights {
    min: -0.299023151
    max: 0.375735193
    size: 1
    element_type: 3
    scale: 87210.359375
    zero_point: 0
  }
  bias {
    min: -2.2023263
    max: 1.95041966
    size: 256
    element_type: 0
    scale: 14878.8125
    zero_point: 0
    value: 0.14718997478485107
    value: 1.4519081115722656
    value: 0.41711655259132385
    value: -0.15379734337329865
    value: -0.9715304970741272
    value: -0.95303815603256226
    value: -0.0783788412809372
    value: -0.62495219707489014
    value: 0.98910748958587646
    value: -1.2158216238021851
    value: -0.12896338105201721
    value: 0.31433907151222229
    value: 0.036893676966428757
    value: 0.089489996433258057
    value: -0.30159521102905273
    value: -0.76961159706115723
    value: -0.083901956677436829
    value: -0.038381338119506836
    value: -0.010298877023160458
    value: -0.37131035327911377
    value: 0.2566094696521759
    value: 0.20245254039764404
    value: -0.33492556214332581
    value: -0.73993325233459473
    value: -0.85540252923965454
    value: 0.30485782027244568
    value: -0.019065793603658676
    value: -0.65976572036743164
    value: -0.90023928880691528
    value: -0.59751629829406738
    value: -0.88581371307373047
    value: -0.18145550787448883
    value: -0.51093524694442749
    value: -0.62601220607757568
    value: 1.1075571775436401
    value: 0.043521277606487274
    value: 0.53652983903884888
    value: 0.6636204719543457
    value: -0.81237787008285522
    value: 0.18675152957439423
    value: 0.98281365633010864
    value: 0.505053699016571
    value: -0.51116245985031128
    value: -1.5224802494049072
    value: 0.96475064754486084
    value: -0.0056420201435685158
    value: 0.39885511994361877
    value: 0.010984331369400024
    value: 0.073209673166275024
    value: 0.121703140437603
    value: 0.14336502552032471
    value: 0.77032804489135742
    value: 1.2405575513839722
    value: -0.337491899728775
    value: -0.072316445410251617
    value: -0.79404544830322266
    value: 0.11432826519012451
    value: 0.216888889670372
    value: -1.1187278032302856
    value: -0.010406289249658585
    value: -0.87316715717315674
    value: 0.070992209017276764
    value: -0.94104677438735962
    value: -0.42112097144126892
    value: -0.7760082483291626
    value: -0.32896283268928528
    value: -0.11177738010883331
    value: -0.6038820743560791
    value: -1.1719012260437012
    value: -0.70051795244216919
    value: 0.53915375471115112
    value: -0.554764986038208
    value: -0.61719989776611328
    value: 1.0359436273574829
    value: -0.28402915596961975
    value: -0.559407114982605
    value: -0.047138597816228867
    value: -0.87341594696044922
    value: 0.8626512885093689
    value: 0.39127928018569946
    value: -0.2988269031047821
    value: 0.4155290424823761
    value: 0.74904489517211914
    value: -1.0412882566452026
    value: 0.40700864791870117
    value: -0.13400176167488098
    value: -0.0607253834605217
    value: -0.29982468485832214
    value: -0.19922494888305664
    value: 0.28494101762771606
    value: 0.02776949480175972
    value: 1.6137138605117798
    value: -1.261730432510376
    value: 0.019311351701617241
    value: -1.2153526544570923
    value: 0.96876925230026245
    value: -0.73531121015548706
    value: -1.5291622877120972
    value: -0.0077640875242650509
    value: -0.37859219312667847
    value: 0.67475616931915283
    value: -0.18016566336154938
    value: 1.9504196643829346
    value: 0.55906349420547485
    value: 0.49268481135368347
    value: -0.348910927772522
    value: 0.20155254006385803
    value: -1.7827174663543701
    value: 0.49429109692573547
    value: -0.051662717014551163
    value: 0.24619366228580475
    value: 0.17176374793052673
    value: 0.023063933476805687
    value: 0.17636910080909729
    value: 1.5460147857666016
    value: -0.77720606327056885
    value: -0.22390778362751007
    value: -0.036227259784936905
    value: -1.1521668434143066
    value: 0.13953769207000732
    value: -0.77457475662231445
    value: -0.55629444122314453
    value: 0.796101987361908
    value: 0.35004425048828125
    value: -0.501491129398346
    value: 0.92100977897644043
    value: -0.048744227737188339
    value: 1.486089825630188
    value: -1.4188241958618164
    value: -0.62576645612716675
    value: 0.26167288422584534
    value: -0.04486624151468277
    value: -0.42060104012489319
    value: 0.14457567036151886
    value: -0.052369534969329834
    value: 0.87330502271652222
    value: 0.070259235799312592
    value: -1.0564103126525879
    value: 0.15855954587459564
    value: -0.1468387097120285
    value: -0.87503761053085327
    value: -0.12565189599990845
    value: -0.322235643863678
    value: -0.28046172857284546
    value: -0.18681114912033081
    value: 0.39716893434524536
    value: -0.48974722623825073
    value: -0.34703803062438965
    value: -0.061629392206668854
    value: 0.31610202789306641
    value: -0.09245617687702179
    value: -0.3508811891078949
    value: -0.3909403383731842
    value: -0.18898983299732208
    value: -1.0801275968551636
    value: 0.55613386631011963
    value: -0.15941961109638214
    value: 0.052459631115198135
    value: 0.34156620502471924
    value: 0.92082071304321289
    value: -0.50937521457672119
    value: 0.31819877028465271
    value: 1.0218150615692139
    value: -0.79317378997802734
    value: -0.22050587832927704
    value: 1.1561434268951416
    value: 0.602313756942749
    value: 0.59678179025650024
    value: -0.018691759556531906
    value: -0.039572309702634811
    value: 0.2968418300151825
    value: -1.6877685785293579
    value: -0.31065788865089417
    value: -0.8494994044303894
    value: 0.787415087223053
    value: 0.288987398147583
    value: 0.35548737645149231
    value: 0.792597234249115
    value: -0.62287288904190063
    value: -0.020508352667093277
    value: 0.57094287872314453
    value: -0.45213237404823303
    value: -0.54670429229736328
    value: -0.75713205337524414
    value: -1.0017443895339966
    value: 0.17024584114551544
    value: -0.52323579788208008
    value: -0.17111453413963318
    value: 0.75081717967987061
    value: 0.65678691864013672
    value: -0.58372902870178223
    value: -2.2023262977600098
    value: -0.78054320812225342
    value: -0.46876639127731323
    value: 0.060962595045566559
    value: -1.6648650169372559
    value: 1.1816738843917847
    value: -0.59360647201538086
    value: -1.3493545055389404
    value: -1.6378931999206543
    value: -1.1467070579528809
    value: 0.1173383817076683
    value: -0.3675101101398468
    value: 0.001610251609236002
