num_layers: 122
quant_type: SYMMETRIC
calib_type: PERTENSOR
layers {
  layer_name: "input"
  layer_type: "TIDL_DataLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 255
    size: 1
    element_type: 6
    scale: 1
    zero_point: 0
  }
}
layers {
  layer_name: "input_netFormat"
  layer_type: "TIDL_DataConvertLayer"
  bit_depth: 4
  outputs {
    min: 0
    max: 254.999954
    size: 1
    element_type: 3
    scale: 128
    zero_point: 0
  }
}
layers {
  layer_name: "1"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: -48.6513863
    max: 48.7318382
    size: 1
    element_type: 3
    scale: 601.9661865234375
    zero_point: 0
  }
  weights {
    min: -0.106318265
    max: 0.0910233408
    size: 1
    element_type: 3
    scale: 308206.6875
    zero_point: 0
  }
  bias {
    min: -2.50275874
    max: 3.28345871
    size: 12
    element_type: 0
    scale: 9979.720703125
    zero_point: 0
    value: 0.79468512535095215
    value: 0.11809707432985306
    value: -0.95500332117080688
    value: 0.9278944730758667
    value: -2.5027587413787842
    value: 0.79571664333343506
    value: 1.0815308094024658
    value: 2.317091703414917
    value: 0.31959682703018188
    value: 3.2834587097167969
    value: -1.492270827293396
    value: -0.0468657985329628
  }
}
layers {
  layer_name: "3"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 39.165535
    size: 1
    element_type: 2
    scale: 879.65313720703125
    zero_point: 0
  }
  weights {
    min: -0.684322238
    max: 0.555610299
    size: 1
    element_type: 3
    scale: 47883.875
    zero_point: 0
  }
  bias {
    min: -1.29372025
    max: 2.92955256
    size: 32
    element_type: 0
    scale: 11185.326171875
    zero_point: 0
    value: 1.1200008392333984
    value: -0.12583637237548828
    value: -0.26208454370498657
    value: 0.68411368131637573
    value: -0.13716815412044525
    value: 0.61980706453323364
    value: -0.18417750298976898
    value: -0.15779921412467957
    value: -0.39740550518035889
    value: 0.693423867225647
    value: -0.12115388363599777
    value: -0.13114844262599945
    value: 0.68494707345962524
    value: 0.54542511701583862
    value: 0.44096073508262634
    value: 0.0014754055300727487
    value: -0.08052092045545578
    value: -1.2937202453613281
    value: -0.22936314344406128
    value: 0.36194545030593872
    value: 2.9295525550842285
    value: 0.64187538623809814
    value: -0.24723874032497406
    value: 2.5000030994415283
    value: 1.4467024803161621
    value: 0.70956552028656006
    value: -0.16794422268867493
    value: -0.13208407163619995
    value: 0.13407380878925323
    value: 1.4263460636138916
    value: -0.18281152844429016
    value: -0.46611246466636658
  }
}
layers {
  layer_name: "5"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 22.986414
    size: 1
    element_type: 2
    scale: 1841.7750244140625
    zero_point: 0
  }
  weights {
    min: -0.477611601
    max: 0.301691353
    size: 1
    element_type: 3
    scale: 68608.046875
    zero_point: 0
  }
  bias {
    min: -3.18741202
    max: 3.25501561
    size: 64
    element_type: 0
    scale: 10066.92578125
    zero_point: 0
    value: -0.46612939238548279
    value: 0.6991417407989502
    value: 3.2550156116485596
    value: 1.4098130464553833
    value: 2.259843111038208
    value: -0.085671223700046539
    value: 1.9610084295272827
    value: 1.2852553129196167
    value: 0.51102924346923828
    value: 1.6118602752685547
    value: 1.8430125713348389
    value: 0.43891620635986328
    value: 0.82055741548538208
    value: 1.2838203907012939
    value: -0.24750763177871704
    value: -0.62467974424362183
    value: 0.53381562232971191
    value: 0.715282142162323
    value: 0.37375512719154358
    value: 0.032342173159122467
    value: 1.1445863246917725
    value: 0.0539887398481369
    value: -0.36764058470726013
    value: 0.029153646901249886
    value: -0.2236579954624176
    value: -0.096603430807590485
    value: -1.1987613439559937
    value: 0.16297227144241333
    value: -3.1874120235443115
    value: 0.4122948944568634
    value: -0.63241171836853027
    value: -0.85093820095062256
    value: -0.026897931471467018
    value: 0.60101950168609619
    value: 2.5127317905426025
    value: -0.26486021280288696
    value: 0.77051520347595215
    value: -0.01982988603413105
    value: -0.02080557681620121
    value: 0.45619684457778931
    value: 0.041382987052202225
    value: 2.7508509159088135
    value: -0.0025385604240000248
    value: 2.4556238651275635
    value: -0.38602396845817566
    value: 0.49997115135192871
    value: -0.10462115705013275
    value: -0.057811107486486435
    value: -0.26000982522964478
    value: -0.16983848810195923
    value: 0.79261106252670288
    value: 0.27240860462188721
    value: -0.70642203092575073
    value: -0.16584032773971558
    value: -0.25454279780387878
    value: 0.69211375713348389
    value: -0.74110221862792969
    value: 0.031717743724584579
    value: -0.0031745093874633312
    value: 0.30549085140228271
    value: 0.59138911962509155
    value: -0.25718015432357788
    value: 1.3477224111557007
    value: 1.05524480342865
  }
}
layers {
  layer_name: "7"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 12.7528048
    size: 1
    element_type: 2
    scale: 3464.9228515625
    zero_point: 0
  }
  weights {
    min: -1.06309724
    max: 0.650191069
    size: 1
    element_type: 3
    scale: 30823.14453125
    zero_point: 0
  }
  bias {
    min: -0.258049607
    max: 4.77746487
    size: 32
    element_type: 0
    scale: 6858.86767578125
    zero_point: 0
    value: 1.6164038181304932
    value: 0.48835015296936035
    value: 1.990338921546936
    value: 0.18322421610355377
    value: 0.91888266801834106
    value: -0.08720003068447113
    value: 0.49651029706001282
    value: 0.69974994659423828
    value: 1.1250500679016113
    value: 0.96000164747238159
    value: 0.68825513124465942
    value: -0.2580496072769165
    value: 2.3136763572692871
    value: 0.044528856873512268
    value: 0.57007980346679688
    value: 0.041137963533401489
    value: 1.218409538269043
    value: 1.6033976078033447
    value: -0.1628408282995224
    value: 1.3960831165313721
    value: 1.2275974750518799
    value: 1.0861601829528809
    value: 1.7801080942153931
    value: 1.5493152141571045
    value: 0.45099058747291565
    value: 1.75931715965271
    value: -0.074908636510372162
    value: 0.98504698276519775
    value: 1.0217850208282471
    value: 4.7774648666381836
    value: -0.0682523101568222
    value: 1.0098710060119629
  }
}
layers {
  layer_name: "9"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 8.31497574
    size: 1
    element_type: 2
    scale: 6619.22705078125
    zero_point: 0
  }
  weights {
    min: -0.556492448
    max: 0.382353812
    size: 1
    element_type: 3
    scale: 58883.09765625
    zero_point: 0
  }
  bias {
    min: -0.0941535309
    max: 2.8556211
    size: 32
    element_type: 0
    scale: 11474.912109375
    zero_point: 0
    value: 0.49164736270904541
    value: 1.37929368019104
    value: 1.7856833934783936
    value: 0.98016589879989624
    value: 1.1032065153121948
    value: -0.094153530895709991
    value: 1.6976567506790161
    value: 1.345650315284729
    value: 0.65209609270095825
    value: 1.8842238187789917
    value: 1.6823215484619141
    value: 0.39242255687713623
    value: 0.74383759498596191
    value: 0.59634697437286377
    value: 0.55248802900314331
    value: 0.29425197839736938
    value: 0.79429394006729126
    value: 0.2608584463596344
    value: 1.018796443939209
    value: 0.47194525599479675
    value: 1.8403735160827637
    value: 2.2995822429656982
    value: -0.089724101126194
    value: 1.5826328992843628
    value: 0.97586286067962646
    value: 1.5198830366134644
    value: 0.91950333118438721
    value: 2.319002628326416
    value: 0.23766396939754486
    value: 1.1226767301559448
    value: 2.8556210994720459
    value: 1.0373064279556274
  }
}
layers {
  layer_name: "11"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 11.7108622
    size: 1
    element_type: 2
    scale: 2489.878662109375
    zero_point: 0
  }
  weights {
    min: -1.15717113
    max: 1.32922685
    size: 1
    element_type: 3
    scale: 24651.923828125
    zero_point: 0
  }
  bias {
    min: -2.73816228
    max: 4.00759888
    size: 32
    element_type: 0
    scale: 8176.466796875
    zero_point: 0
    value: 4.007598876953125
    value: 3.7177622318267822
    value: 0.65314346551895142
    value: -0.1922401487827301
    value: 1.9491962194442749
    value: 0.616098940372467
    value: 1.9608838558197021
    value: 0.76092320680618286
    value: -1.9247062206268311
    value: 2.7346153259277344
    value: -1.5084508657455444
    value: 3.3142106533050537
    value: -1.9884098768234253
    value: 0.59973388910293579
    value: 2.9895415306091309
    value: -1.6422336101531982
    value: 2.2854411602020264
    value: -2.7381622791290283
    value: 0.74381405115127563
    value: -1.8023812770843506
    value: 0.44035449624061584
    value: 2.7847516536712646
    value: 4.0038752555847168
    value: 1.4382349252700806
    value: 2.07124662399292
    value: -0.23218484222888947
    value: -1.6525528430938721
    value: 2.2520606517791748
    value: -0.2915114164352417
    value: 3.2209863662719727
    value: -1.0922756195068359
    value: 2.1563999652862549
  }
}
layers {
  layer_name: "13"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 12.8740168
    size: 1
    element_type: 2
    scale: 4559.2021484375
    zero_point: 0
  }
  weights {
    min: -1.09224319
    max: 0.769010067
    size: 1
    element_type: 3
    scale: 30000.64453125
    zero_point: 0
  }
  bias {
    min: -1.96455479
    max: 7.24556923
    size: 32
    element_type: 0
    scale: 4522.48779296875
    zero_point: 0
    value: 0.95333200693130493
    value: -0.88442623615264893
    value: 0.74152129888534546
    value: 0.042966622859239578
    value: -1.8493145704269409
    value: 1.206263542175293
    value: -0.1467113196849823
    value: 2.7869069576263428
    value: 3.0737030506134033
    value: -0.94605463743209839
    value: -0.4678000807762146
    value: -1.0636775493621826
    value: -0.31510385870933533
    value: -1.0358555316925049
    value: 1.4280864000320435
    value: 1.025874137878418
    value: 0.035158686339855194
    value: -1.9645547866821289
    value: 0.11417623609304428
    value: 2.0445733070373535
    value: 1.2441219091415405
    value: 7.2455692291259766
    value: 0.58230823278427124
    value: 1.6712275743484497
    value: 2.2718422412872314
    value: 1.2824422121047974
    value: 1.5198774337768555
    value: -0.15193137526512146
    value: -1.7608176469802856
    value: 0.27965998649597168
    value: 3.6341269016265869
    value: -0.74969804286956787
  }
}
layers {
  layer_name: "14"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 14.854744
    size: 1
    element_type: 2
    scale: 2279.60107421875
    zero_point: 0
  }
}
layers {
  layer_name: "15"
  layer_type: "TIDL_ConcatLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 15.0604372
    size: 1
    element_type: 2
    scale: 2279.60107421875
    zero_point: 0
  }
}
layers {
  layer_name: "17"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 14.2576313
    size: 1
    element_type: 2
    scale: 3591.05712890625
    zero_point: 0
  }
  weights {
    min: -0.894792438
    max: 1.26959884
    size: 1
    element_type: 3
    scale: 25809.7265625
    zero_point: 0
  }
  bias {
    min: -2.27541924
    max: 5.15247107
    size: 64
    element_type: 0
    scale: 6359.6669921875
    zero_point: 0
    value: 2.0229077339172363
    value: 2.8547117710113525
    value: 0.22151434421539307
    value: 0.9341200590133667
    value: 3.0659902095794678
    value: 3.073521614074707
    value: 0.97913831472396851
    value: 0.5973970890045166
    value: 0.90306472778320312
    value: -1.4875043630599976
    value: 0.23956893384456635
    value: 2.6978826522827148
    value: -0.721393346786499
    value: -0.68309813737869263
    value: 0.87040036916732788
    value: 1.3292403221130371
    value: 0.50858855247497559
    value: 4.1989040374755859
    value: -0.27792507410049438
    value: 0.98102492094039917
    value: 0.59192031621932983
    value: -0.028374599292874336
    value: 0.4249567985534668
    value: 1.8473641872406006
    value: 0.92673945426940918
    value: 3.7788040637969971
    value: 2.1594133377075195
    value: 1.1373958587646484
    value: 2.635483980178833
    value: -1.4577538967132568
    value: 0.39253532886505127
    value: 2.6620559692382812
    value: 2.1511569023132324
    value: 1.9952132701873779
    value: -0.19614455103874207
    value: 2.3316576480865479
    value: 1.150431752204895
    value: 1.6212755441665649
    value: 2.0672245025634766
    value: 2.021841287612915
    value: 0.97877472639083862
    value: 3.1027810573577881
    value: 3.5765316486358643
    value: 2.563413143157959
    value: -1.300580620765686
    value: -1.3093326091766357
    value: 1.990206241607666
    value: 5.15247106552124
    value: -2.2754192352294922
    value: 2.6128876209259033
    value: -0.1783900260925293
    value: 3.7853083610534668
    value: 1.7387380599975586
    value: 2.3346548080444336
    value: 1.5517282485961914
    value: -0.19505058228969574
    value: 3.0879848003387451
    value: -0.03351399302482605
    value: 2.9717311859130859
    value: -0.050104975700378418
    value: -0.78607738018035889
    value: 0.76348310708999634
    value: 0.2369554340839386
    value: 2.8329324722290039
  }
}
layers {
  layer_name: "19"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 10.5610971
    size: 1
    element_type: 2
    scale: 4966.55126953125
    zero_point: 0
  }
  weights {
    min: -0.296642125
    max: 0.361524194
    size: 1
    element_type: 3
    scale: 90638.46875
    zero_point: 0
  }
  bias {
    min: -1.75483334
    max: 2.17157888
    size: 128
    element_type: 0
    scale: 15089.4814453125
    zero_point: 0
    value: 0.47016757726669312
    value: 0.12327535450458527
    value: 0.663318395614624
    value: 0.1770438551902771
    value: -1.0410206317901611
    value: 0.34416663646698
    value: 1.0073575973510742
    value: 1.2354699373245239
    value: 0.37790876626968384
    value: 0.17043380439281464
    value: 0.22440624237060547
    value: 0.48187324404716492
    value: 0.51925122737884521
    value: -1.1413213014602661
    value: 0.49170380830764771
    value: -0.24496951699256897
    value: 1.1266162395477295
    value: 0.1944451630115509
    value: 1.0409152507781982
    value: -0.25320222973823547
    value: 1.0731865167617798
    value: 0.95658397674560547
    value: 0.25995299220085144
    value: 0.88828510046005249
    value: 1.1652629375457764
    value: 1.1097975969314575
    value: 0.75008082389831543
    value: 1.0620429515838623
    value: -0.35146000981330872
    value: 1.0484855175018311
    value: -0.923040509223938
    value: -0.86355125904083252
    value: -0.4662783145904541
    value: 1.5421047210693359
    value: 0.40329030156135559
    value: -0.14655992388725281
    value: 0.29019215703010559
    value: 0.1806986927986145
    value: -0.25395259261131287
    value: 0.26566940546035767
    value: 0.32330071926116943
    value: 0.47861167788505554
    value: 2.1715788841247559
    value: 0.46260419487953186
    value: -0.64414846897125244
    value: -0.022966373711824417
    value: 0.10690552741289139
    value: -0.29434630274772644
    value: -0.15151090919971466
    value: 1.1785365343093872
    value: -0.60331624746322632
    value: 0.64617091417312622
    value: 0.043898876756429672
    value: -0.014133227057754993
    value: 1.254690408706665
    value: -0.10621961951255798
    value: -0.91438686847686768
    value: 0.19645135104656219
    value: 0.094068422913551331
    value: -0.55553889274597168
    value: 0.88316214084625244
    value: 1.3277153968811035
    value: 0.27519732713699341
    value: 0.67681723833084106
    value: 0.966178297996521
    value: -0.65280449390411377
    value: 0.36661297082901
    value: -0.30134668946266174
    value: -0.052592821419239044
    value: 0.525711715221405
    value: -0.89859014749526978
    value: 0.17558395862579346
    value: -0.033701986074447632
    value: 0.76098030805587769
    value: -0.040191881358623505
    value: 0.62311291694641113
    value: -0.3380005955696106
    value: 1.0107390880584717
    value: -0.30570563673973083
    value: -0.66003167629241943
    value: -1.4681901931762695
    value: 0.42218735814094543
    value: -0.14660201966762543
    value: 0.29587656259536743
    value: 0.66136699914932251
    value: 1.463132381439209
    value: 0.62124747037887573
    value: -0.6240194439888
    value: 2.0971453189849854
    value: -0.43641644716262817
    value: -1.7548333406448364
    value: 0.334499716758728
    value: -0.058120258152484894
    value: 0.80168700218200684
    value: 0.64452219009399414
    value: -0.42905059456825256
    value: -0.73936140537261963
    value: -0.21372437477111816
    value: 0.86566579341888428
    value: 0.62676519155502319
    value: 0.52506119012832642
    value: 1.9161970615386963
    value: 0.50817543268203735
    value: -0.23357260227203369
    value: 0.11607585847377777
    value: 0.39384353160858154
    value: -0.36164605617523193
    value: 0.19800019264221191
    value: -0.13608022034168243
    value: 1.2917759418487549
    value: 0.072414696216583252
    value: 1.3385468721389771
    value: 1.1009479761123657
    value: 0.90661782026290894
    value: 1.5188969373703003
    value: 1.792878270149231
    value: 0.67675715684890747
    value: 0.63469612598419189
    value: 0.63172483444213867
    value: 0.978921115398407
    value: 0.24808475375175476
    value: 0.69954216480255127
    value: -0.52523839473724365
    value: 0.62353003025054932
    value: -1.2829293012619019
    value: -0.81310188770294189
    value: 0.16773615777492523
    value: 1.3306423425674438
  }
}
layers {
  layer_name: "21"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 15.2226858
    size: 1
    element_type: 2
    scale: 2551.01025390625
    zero_point: 0
  }
  weights {
    min: -0.859740257
    max: 0.973447919
    size: 1
    element_type: 3
    scale: 33661.7890625
    zero_point: 0
  }
  bias {
    min: -4.15545416
    max: 3.00523734
    size: 64
    element_type: 0
    scale: 7885.5400390625
    zero_point: 0
    value: -2.8289272785186768
    value: -0.05648210272192955
    value: 2.4695887565612793
    value: -1.043931245803833
    value: -2.1237845420837402
    value: 1.973552942276001
    value: -0.58627748489379883
    value: -1.4642434120178223
    value: 0.49056598544120789
    value: 0.57295316457748413
    value: 0.22617322206497192
    value: 1.6496733427047729
    value: 0.48700693249702454
    value: -1.2060840129852295
    value: 2.6595158576965332
    value: -0.96303892135620117
    value: 2.0270462036132812
    value: 1.2465866804122925
    value: -0.087117567658424377
    value: 1.3689022064208984
    value: -1.4320070743560791
    value: -0.8334498405456543
    value: 1.4962663650512695
    value: 2.5059134960174561
    value: -1.4574726819992065
    value: 0.38096174597740173
    value: -0.96001440286636353
    value: -0.35084012150764465
    value: 0.20698796212673187
    value: 0.61750799417495728
    value: -0.23361247777938843
    value: 0.72796320915222168
    value: 0.12319152802228928
    value: 0.597099244594574
    value: 0.10252948850393295
    value: -0.18101756274700165
    value: 1.542199969291687
    value: 0.53345823287963867
    value: 1.0392814874649048
    value: -1.0256503820419312
    value: 0.006840068381279707
    value: 0.22393324971199036
    value: 1.8405182361602783
    value: -0.363334596157074
    value: 1.828521728515625
    value: 0.23613457381725311
    value: -0.82695561647415161
    value: 2.7215423583984375
    value: 0.48908895254135132
    value: 2.1679346561431885
    value: -0.19142638146877289
    value: -4.155454158782959
    value: 0.7548021674156189
    value: -1.5365830659866333
    value: 0.06258663535118103
    value: -0.22077271342277527
    value: 2.2576084136962891
    value: 0.81890314817428589
    value: 3.005237340927124
    value: -0.366310179233551
    value: 0.42343640327453613
    value: -0.128361776471138
    value: -0.91672658920288086
    value: -0.25528010725975037
  }
}
layers {
  layer_name: "23"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 5.76672029
    size: 1
    element_type: 2
    scale: 6495.0205078125
    zero_point: 0
  }
  weights {
    min: -0.280193776
    max: 0.382335305
    size: 1
    element_type: 3
    scale: 85704.875
    zero_point: 0
  }
  bias {
    min: -1.12832499
    max: 2.23044372
    size: 64
    element_type: 0
    scale: 14691.2470703125
    zero_point: 0
    value: -0.13258515298366547
    value: 0.25607526302337646
    value: 0.23108167946338654
    value: -0.34203660488128662
    value: 0.29871329665184021
    value: -0.030357763171195984
    value: 0.95936453342437744
    value: 1.699195384979248
    value: 1.6324201822280884
    value: 1.7060208320617676
    value: 0.77194696664810181
    value: 1.2052898406982422
    value: 0.71460920572280884
    value: 0.79868292808532715
    value: -0.3481827974319458
    value: 0.45875561237335205
    value: 1.0128756761550903
    value: 0.57863253355026245
    value: 0.63290584087371826
    value: 0.0680331438779831
    value: 0.94906681776046753
    value: -0.3825078010559082
    value: 1.0392827987670898
    value: -0.10265950113534927
    value: 0.251099169254303
    value: 1.1034210920333862
    value: 0.87660306692123413
    value: 0.95456826686859131
    value: -0.37997594475746155
    value: -0.028345458209514618
    value: 1.8017734289169312
    value: 0.94558215141296387
    value: 0.0539977066218853
    value: 0.70693325996398926
    value: 0.99999779462814331
    value: 0.36876574158668518
    value: 0.92359119653701782
    value: 0.53034305572509766
    value: 0.55341839790344238
    value: 2.2304437160491943
    value: -0.18460310995578766
    value: 0.45090824365615845
    value: 1.226136326789856
    value: 0.46987426280975342
    value: 1.628432035446167
    value: 2.0397276878356934
    value: -1.1283249855041504
    value: 1.59055495262146
    value: 0.76885050535202026
    value: -0.35997971892356873
    value: 0.67192453145980835
    value: 1.0852522850036621
    value: -0.036966823041439056
    value: 0.43602615594863892
    value: 0.15342921018600464
    value: 0.33181935548782349
    value: 0.78027665615081787
    value: 0.91862642765045166
    value: 1.0381685495376587
    value: 1.7507621049880981
    value: 0.51469641923904419
    value: 0.062577471137046814
    value: 1.9477078914642334
    value: 0.040400121361017227
  }
}
layers {
  layer_name: "25"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 7.76701641
    size: 1
    element_type: 2
    scale: 3203.32421875
    zero_point: 0
  }
  weights {
    min: -0.96213752
    max: 1.01379383
    size: 1
    element_type: 3
    scale: 32322.154296875
    zero_point: 0
  }
  bias {
    min: -3.85958
    max: 3.24486327
    size: 64
    element_type: 0
    scale: 8490.04296875
    zero_point: 0
    value: 1.8961701393127441
    value: -0.552972137928009
    value: 1.0317267179489136
    value: -0.17328828573226929
    value: -0.23822055757045746
    value: -0.055818196386098862
    value: -0.43948742747306824
    value: -0.18876734375953674
    value: -1.3513234853744507
    value: -1.3353298902511597
    value: 3.20028018951416
    value: 1.4710797071456909
    value: 0.78672611713409424
    value: -0.030715171247720718
    value: -0.2232731431722641
    value: -0.54163742065429688
    value: -0.17903526127338409
    value: 0.32016029953956604
    value: 3.2448632717132568
    value: -3.0196325778961182
    value: -1.8391655683517456
    value: 1.6892547607421875
    value: 1.7945364713668823
    value: 1.5601197481155396
    value: -1.6783056259155273
    value: 0.48311641812324524
    value: 0.38622751832008362
    value: -1.4582351446151733
    value: 0.767521321773529
    value: -3.1496405601501465
    value: 1.8948720693588257
    value: -3.8595800399780273
    value: 1.474936842918396
    value: 0.66555625200271606
    value: 1.4403355121612549
    value: 1.3328080177307129
    value: -1.7575836181640625
    value: -0.2777288556098938
    value: -1.6349155902862549
    value: 1.685215950012207
    value: 0.49535092711448669
    value: 2.1024124622344971
    value: 2.8078930377960205
    value: 0.22881671786308289
    value: 0.71995258331298828
    value: -0.77440750598907471
    value: 1.729230523109436
    value: -1.8160797357559204
    value: 2.5923054218292236
    value: 2.5935180187225342
    value: 0.65097624063491821
    value: 0.98791438341140747
    value: 1.9625852108001709
    value: 1.3502206802368164
    value: -2.5423402786254883
    value: -3.1723816394805908
    value: 0.091384038329124451
    value: 0.19164621829986572
    value: -2.3787078857421875
    value: 2.2625629901885986
    value: 1.96708345413208
    value: -2.9267477989196777
    value: -0.96522486209869385
    value: -0.65342032909393311
  }
}
layers {
  layer_name: "27"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 5.32650232
    size: 1
    element_type: 2
    scale: 9572.171875
    zero_point: 0
  }
  weights {
    min: -0.258809894
    max: 0.334649682
    size: 1
    element_type: 3
    scale: 97917.3203125
    zero_point: 0
  }
  bias {
    min: -0.87983489
    max: 3.58334494
    size: 64
    element_type: 0
    scale: 9144.5283203125
    zero_point: 0
    value: -0.085755005478858948
    value: -0.062268596142530441
    value: -0.0072337063029408455
    value: -0.24795979261398315
    value: -0.14240919053554535
    value: 0.409172385931015
    value: 0.072333104908466339
    value: -0.87983489036560059
    value: 0.16365519165992737
    value: 0.88910025358200073
    value: -0.00075225235195830464
    value: 0.055876463651657104
    value: 0.37160271406173706
    value: 0.69437140226364136
    value: -0.81773030757904053
    value: 0.88740837574005127
    value: -0.24464963376522064
    value: -0.2153879702091217
    value: 0.18552204966545105
    value: -0.57701021432876587
    value: -0.56487077474594116
    value: -0.12614986300468445
    value: -0.37448769807815552
    value: -0.28066056966781616
    value: -0.19367536902427673
    value: -0.063902176916599274
    value: -0.67504596710205078
    value: -0.77202796936035156
    value: 0.61800181865692139
    value: -0.082456916570663452
    value: -0.18553614616394043
    value: 0.70452547073364258
    value: 0.57636803388595581
    value: -0.12856872379779816
    value: -0.32885229587554932
    value: 0.12358453124761581
    value: -0.24787320196628571
    value: -0.031863782554864883
    value: 0.21547959744930267
    value: -0.15255564451217651
    value: 0.29576361179351807
    value: 0.2634948194026947
    value: -0.40847516059875488
    value: 0.35009893774986267
    value: -0.54157459735870361
    value: 0.2645142674446106
    value: -0.33281052112579346
    value: 3.5833449363708496
    value: 1.2504127025604248
    value: -0.53404372930526733
    value: -0.46997079253196716
    value: 0.15693995356559753
    value: -0.80948543548583984
    value: -0.16276097297668457
    value: 0.12161559611558914
    value: 0.34432941675186157
    value: 0.49809044599533081
    value: -0.45430383086204529
    value: -0.43930873274803162
    value: 0.48598432540893555
    value: -0.45749184489250183
    value: -0.48482778668403625
    value: -0.00542176328599453
    value: 0.2192104160785675
  }
}
layers {
  layer_name: "28"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 7.48158216
    size: 1
    element_type: 2
    scale: 6495.0205078125
    zero_point: 0
  }
}
layers {
  layer_name: "30"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 8.72032642
    size: 1
    element_type: 2
    scale: 6031.177734375
    zero_point: 0
  }
  weights {
    min: -0.734649837
    max: 1.07690752
    size: 1
    element_type: 3
    scale: 30427.869140625
    zero_point: 0
  }
  bias {
    min: -2.92344093
    max: 4.38925314
    size: 64
    element_type: 0
    scale: 7465.5068359375
    zero_point: 0
    value: -0.59725362062454224
    value: 1.3280171155929565
    value: -0.014996995218098164
    value: -0.71285057067871094
    value: 0.482435941696167
    value: -0.88511663675308228
    value: 0.33019253611564636
    value: -1.3318988084793091
    value: 0.19589878618717194
    value: -1.6109006404876709
    value: 3.5101966857910156
    value: -0.462079793214798
    value: -0.45562279224395752
    value: 0.35356062650680542
    value: -0.94806873798370361
    value: 1.480879545211792
    value: 0.649677574634552
    value: 0.56306171417236328
    value: 0.10717395693063736
    value: 0.89121699333190918
    value: 0.60466408729553223
    value: -2.1729929447174072
    value: -0.69617640972137451
    value: 1.5366060733795166
    value: -0.76395851373672485
    value: 0.048578925430774689
    value: 2.5862703323364258
    value: 2.0785493850708008
    value: 1.4931998252868652
    value: 0.91868495941162109
    value: -0.38440880179405212
    value: 4.38925313949585
    value: -2.5263757705688477
    value: 2.037935733795166
    value: -0.066206716001033783
    value: 0.27614414691925049
    value: 2.8847000598907471
    value: 2.4963614940643311
    value: -2.0821492671966553
    value: 1.0349045991897583
    value: 1.7239866256713867
    value: -0.22590702772140503
    value: 1.548112154006958
    value: -0.83952540159225464
    value: 0.25512003898620605
    value: 2.4971256256103516
    value: -0.43130901455879211
    value: 0.17943692207336426
    value: -0.72458392381668091
    value: 2.9472031593322754
    value: -2.2905318737030029
    value: 1.7657543420791626
    value: -1.2062082290649414
    value: 4.2239127159118652
    value: -2.5443019866943359
    value: 0.034713279455900192
    value: 1.3352359533309937
    value: -1.0801844596862793
    value: 3.2980139255523682
    value: 0.5679556131362915
    value: 4.3108749389648438
    value: 2.4909582138061523
    value: 1.8035374879837036
    value: -2.9234409332275391
  }
}
layers {
  layer_name: "32"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 7.492239
    size: 1
    element_type: 2
    scale: 5824.2265625
    zero_point: 0
  }
  weights {
    min: -0.303598911
    max: 0.517766416
    size: 1
    element_type: 3
    scale: 63287.2265625
    zero_point: 0
  }
  bias {
    min: -1.79131269
    max: 2.20544529
    size: 64
    element_type: 0
    scale: 14857.7705078125
    zero_point: 0
    value: 0.9041551947593689
    value: 0.83372777700424194
    value: 0.53450942039489746
    value: -0.62294244766235352
    value: 0.56568342447280884
    value: 0.27690395712852478
    value: -0.34153056144714355
    value: -1.7913126945495605
    value: 0.779565691947937
    value: 0.096904575824737549
    value: 0.56547117233276367
    value: 0.91678512096405029
    value: -0.14531178772449493
    value: 0.23582611978054047
    value: -0.91550713777542114
    value: 1.1871201992034912
    value: 0.4044138491153717
    value: -0.4038899838924408
    value: -0.48778024315834045
    value: 0.055353503674268723
    value: -0.60427051782608032
    value: 0.12942680716514587
    value: -0.74881815910339355
    value: 0.18794941902160645
    value: 0.26923254132270813
    value: 0.73637485504150391
    value: -0.14219990372657776
    value: -0.10255727171897888
    value: 0.72453171014785767
    value: 0.16911755502223969
    value: 0.46555855870246887
    value: 1.2177846431732178
    value: 0.53384518623352051
    value: 0.17078879475593567
    value: -0.0523407980799675
    value: 1.2813918590545654
    value: -0.51976829767227173
    value: -0.16894353926181793
    value: 0.552618145942688
    value: 0.69035619497299194
    value: 0.37454357743263245
    value: 1.1316187381744385
    value: -0.22510883212089539
    value: 0.86114245653152466
    value: 0.70697635412216187
    value: 0.80157482624053955
    value: 0.01974472776055336
    value: 2.2054452896118164
    value: 0.14999599754810333
    value: -0.30708456039428711
    value: -0.85939353704452515
    value: -0.36793327331542969
    value: 0.37930744886398315
    value: -0.91806238889694214
    value: 0.18704788386821747
    value: -0.23327910900115967
    value: 0.0449117086827755
    value: 0.76333659887313843
    value: 0.17388179898262024
    value: -0.014039594680070877
    value: -0.79730308055877686
    value: 0.43165585398674011
    value: -0.088521264493465424
    value: -0.67407900094985962
  }
}
layers {
  layer_name: "33"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 10.6364565
    size: 1
    element_type: 2
    scale: 2912.11328125
    zero_point: 0
  }
}
layers {
  layer_name: "35"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 7.75453329
    size: 1
    element_type: 2
    scale: 3702.215576171875
    zero_point: 0
  }
  weights {
    min: -0.696745932
    max: 0.786586583
    size: 1
    element_type: 3
    scale: 41658.4765625
    zero_point: 0
  }
  bias {
    min: -4.67005682
    max: 3.26787448
    size: 64
    element_type: 0
    scale: 7016.6171875
    zero_point: 0
    value: -2.5034582614898682
    value: 0.73703670501708984
    value: -0.24403944611549377
    value: -4.6700568199157715
    value: 1.6029917001724243
    value: -0.24149958789348602
    value: 0.60877698659896851
    value: 1.8012232780456543
    value: -0.33811399340629578
    value: -0.5862237811088562
    value: 0.99570798873901367
    value: 0.44709578156471252
    value: 0.93105369806289673
    value: -0.46350690722465515
    value: -0.0192624069750309
    value: 2.6779496669769287
    value: 1.0195076465606689
    value: 3.2678744792938232
    value: 2.3345530033111572
    value: 0.25410151481628418
    value: -0.092776015400886536
    value: 0.035743076354265213
    value: 2.0378832817077637
    value: -0.78948491811752319
    value: -0.30190443992614746
    value: 0.92026299238204956
    value: 1.3843708038330078
    value: -0.29173895716667175
    value: 3.0334861278533936
    value: 0.98899900913238525
    value: -2.6980490684509277
    value: -0.46791693568229675
    value: 0.24240061640739441
    value: -0.19153799116611481
    value: -0.11287438869476318
    value: -2.4525554180145264
    value: 2.8983354568481445
    value: -1.2594946622848511
    value: -0.013889512047171593
    value: 1.2830301523208618
    value: 2.2451119422912598
    value: 0.90628087520599365
    value: -3.1342024803161621
    value: 1.4277980327606201
    value: 1.0018925666809082
    value: 2.2553856372833252
    value: 1.3678275346755981
    value: -1.599162220954895
    value: 0.034175261855125427
    value: -0.34147775173187256
    value: 0.20984801650047302
    value: 2.2374098300933838
    value: 1.784490704536438
    value: -1.4603168964385986
    value: 0.52606326341629028
    value: 2.3783175945281982
    value: 2.8813738822937012
    value: -2.5166923999786377
    value: 1.0587290525436401
    value: 1.5874462127685547
    value: -1.0882021188735962
    value: 0.97124791145324707
    value: -0.61083394289016724
    value: -0.0024135017301887274
  }
}
layers {
  layer_name: "37"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 11.3098145
    size: 1
    element_type: 2
    scale: 4274.0634765625
    zero_point: 0
  }
  weights {
    min: -0.651076794
    max: 0.866205096
    size: 1
    element_type: 3
    scale: 37829.37890625
    zero_point: 0
  }
  bias {
    min: -1.69582367
    max: 9.13671494
    size: 64
    element_type: 0
    scale: 3586.409423828125
    zero_point: 0
    value: -1.5010851621627808
    value: 0.16469940543174744
    value: 0.9842686653137207
    value: 1.6413348913192749
    value: -0.12059339135885239
    value: 1.6731135845184326
    value: 1.0335811376571655
    value: 1.8673460483551025
    value: 1.378242015838623
    value: 0.078337825834751129
    value: -0.11893622577190399
    value: 0.074587449431419373
    value: 1.193871021270752
    value: -0.035499017685651779
    value: -0.39811599254608154
    value: 0.83216434717178345
    value: 0.97142630815505981
    value: 0.1688038557767868
    value: -0.33666011691093445
    value: 0.18263350427150726
    value: -0.64202225208282471
    value: -0.65901219844818115
    value: 0.88822013139724731
    value: 0.27474528551101685
    value: 0.23937611281871796
    value: 1.7743479013442993
    value: -0.62848508358001709
    value: 2.904426097869873
    value: 0.2541579008102417
    value: 1.5390071868896484
    value: -0.48597574234008789
    value: 1.4301356077194214
    value: 0.94092625379562378
    value: 0.76050794124603271
    value: -1.0552328824996948
    value: 0.95109230279922485
    value: -0.34351453185081482
    value: -1.6958236694335938
    value: 0.50640600919723511
    value: 2.614116907119751
    value: -0.754239022731781
    value: -0.40329515933990479
    value: 0.12225989252328873
    value: 0.84583282470703125
    value: 1.4512484073638916
    value: 9.1367149353027344
    value: 0.20105759799480438
    value: 2.1348631381988525
    value: -1.0145301818847656
    value: 0.18807530403137207
    value: 0.3655850887298584
    value: -0.30041149258613586
    value: 0.69889622926712036
    value: 0.14624278247356415
    value: 0.48559218645095825
    value: 0.1279321163892746
    value: -0.24932511150836945
    value: 0.30945658683776855
    value: -0.49261632561683655
    value: -0.95406824350357056
    value: -1.2607860565185547
    value: 2.2654087543487549
    value: 0.74684453010559082
    value: 1.1692459583282471
  }
}
layers {
  layer_name: "38"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 15.861558
    size: 1
    element_type: 2
    scale: 2912.11328125
    zero_point: 0
  }
}
layers {
  layer_name: "39"
  layer_type: "TIDL_ConcatLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 16.9367218
    size: 1
    element_type: 2
    scale: 2551.01025390625
    zero_point: 0
  }
}
layers {
  layer_name: "41"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 12.1925039
    size: 1
    element_type: 2
    scale: 4586.93212890625
    zero_point: 0
  }
  weights {
    min: -0.556147397
    max: 0.479685903
    size: 1
    element_type: 3
    scale: 58919.6328125
    zero_point: 0
  }
  bias {
    min: -3.38646507
    max: 4.16510296
    size: 128
    element_type: 0
    scale: 7867.2724609375
    zero_point: 0
    value: 0.16081398725509644
    value: 0.47728708386421204
    value: 0.12617488205432892
    value: 1.6631945371627808
    value: -0.37141603231430054
    value: 0.56900346279144287
    value: 1.7819949388504028
    value: -0.24423293769359589
    value: -0.6541784405708313
    value: 1.0929667949676514
    value: 0.40192553400993347
    value: 0.14031395316123962
    value: 1.1518393754959106
    value: -1.0187110900878906
    value: 0.89452630281448364
    value: 1.603818416595459
    value: 1.5929851531982422
    value: -0.57338297367095947
    value: -0.53773403167724609
    value: 0.95874863862991333
    value: 0.6523934006690979
    value: 1.0429140329360962
    value: 1.0952333211898804
    value: 0.29299911856651306
    value: -1.5517916679382324
    value: 2.3006465435028076
    value: 0.041486840695142746
    value: 1.9192782640457153
    value: -1.2664002180099487
    value: 1.2111639976501465
    value: 0.13581399619579315
    value: 1.1249157190322876
    value: 0.1900317370891571
    value: 1.4683099985122681
    value: -2.76161789894104
    value: -0.035684149712324142
    value: 1.9847300052642822
    value: 1.7372695207595825
    value: 0.45488071441650391
    value: 1.1925126314163208
    value: 0.64185017347335815
    value: -0.57350218296051025
    value: -1.6075479984283447
    value: 0.34908628463745117
    value: 0.99380046129226685
    value: 0.81041139364242554
    value: 0.68941056728363037
    value: -0.88858181238174438
    value: 1.4510481357574463
    value: 1.37326180934906
    value: 0.83664137125015259
    value: -1.2674782276153564
    value: 0.065230384469032288
    value: -1.6588394641876221
    value: 1.613538384437561
    value: 0.86307978630065918
    value: 0.36260730028152466
    value: 0.33369249105453491
    value: -1.6837373971939087
    value: 1.4555940628051758
    value: -0.14966356754302979
    value: 1.258186936378479
    value: 1.1578911542892456
    value: -1.1710196733474731
    value: -3.3864650726318359
    value: 1.9227145910263062
    value: 1.5092371702194214
    value: 2.086761474609375
    value: -1.5810474157333374
    value: -0.080768793821334839
    value: 1.4214446544647217
    value: 0.54269307851791382
    value: 1.6496413946151733
    value: 0.1085427850484848
    value: 0.47177141904830933
    value: -1.8424786329269409
    value: -1.6259192228317261
    value: 0.81432223320007324
    value: 0.74809157848358154
    value: -0.27497193217277527
    value: -1.9748729467391968
    value: -1.5690921545028687
    value: -1.0916990041732788
    value: 0.774411678314209
    value: 0.19125418365001678
    value: 1.6878020763397217
    value: 2.8865418434143066
    value: 0.32809358835220337
    value: -0.22123648226261139
    value: 0.13663648068904877
    value: 0.64781612157821655
    value: 1.0819324254989624
    value: 0.76978778839111328
    value: 1.8161914348602295
    value: 0.26675626635551453
    value: -0.34363275766372681
    value: 1.1561735868453979
    value: -1.7315875291824341
    value: -1.511867880821228
    value: -0.4439501166343689
    value: 0.374008446931839
    value: -1.0740479230880737
    value: 0.16633997857570648
    value: 4.1651029586791992
    value: -0.65527313947677612
    value: -1.329454779624939
    value: 0.73912423849105835
    value: 1.7682870626449585
    value: -0.16461922228336334
    value: 1.5637544393539429
    value: 1.0010712146759033
    value: 0.5493004322052002
    value: -0.47886717319488525
    value: 0.25628113746643066
    value: -0.46628668904304504
    value: 0.28206101059913635
    value: -1.0853927135467529
    value: 0.17954184114933014
    value: 0.71649777889251709
    value: -1.4974061250686646
    value: -0.51063328981399536
    value: -0.39594021439552307
    value: 0.13761788606643677
    value: 1.676356315612793
    value: -2.2621729373931885
    value: 0.60191726684570312
    value: -0.80377072095870972
    value: 1.1332653760910034
  }
}
layers {
  layer_name: "43"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 9.92892933
    size: 1
    element_type: 2
    scale: 3391.75634765625
    zero_point: 0
  }
  weights {
    min: -0.338094175
    max: 0.308397055
    size: 1
    element_type: 3
    scale: 96919.7421875
    zero_point: 0
  }
  bias {
    min: -2.3581965
    max: 1.7196306
    size: 256
    element_type: 0
    scale: 13895.3642578125
    zero_point: 0
    value: 0.19838075339794159
    value: 1.4833842515945435
    value: -0.30557462573051453
    value: -0.31932473182678223
    value: -1.0388200283050537
    value: -0.96821349859237671
    value: 0.50756269693374634
    value: -0.72916966676712036
    value: 0.049148257821798325
    value: -1.0113703012466431
    value: 0.011365398764610291
    value: 0.23793978989124298
    value: 0.84502500295639038
    value: 0.23095992207527161
    value: -0.2969403862953186
    value: -0.75129497051239014
    value: -0.059860553592443466
    value: -0.95476967096328735
    value: 0.73518079519271851
    value: -0.60052222013473511
    value: -0.168717160820961
    value: 0.29420384764671326
    value: -0.24605685472488403
    value: -0.13132816553115845
    value: 0.608252763748169
    value: 0.81817549467086792
    value: -0.47391003370285034
    value: -0.85866242647171021
    value: -0.9939037561416626
    value: -0.35570931434631348
    value: -0.001684631104581058
    value: -0.5216977596282959
    value: -0.45438128709793091
    value: 0.10345537960529327
    value: 0.90091860294342041
    value: 0.36265552043914795
    value: 0.55322074890136719
    value: -0.183463916182518
    value: -0.67850464582443237
    value: -0.22039231657981873
    value: -0.09178326278924942
    value: 0.25730228424072266
    value: -0.39862793684005737
    value: -0.062498912215232849
    value: -0.0025504238437861204
    value: 0.14460338652133942
    value: -0.628585934638977
    value: -0.14210979640483856
    value: -0.67480581998825073
    value: 0.55366182327270508
    value: -0.67547100782394409
    value: 1.0062626600265503
    value: 1.1546893119812012
    value: -0.33145582675933838
    value: -0.19735352694988251
    value: -0.801923394203186
    value: 0.18683120608329773
    value: 0.2501838207244873
    value: -1.3076165914535522
    value: -0.15829381346702576
    value: -0.50159245729446411
    value: 0.93447041511535645
    value: 0.41860127449035645
    value: 0.47474744915962219
    value: 0.12089704722166061
    value: 0.16747234761714935
    value: 0.14100682735443115
    value: -0.55019712448120117
    value: -0.92961925268173218
    value: -0.62350231409072876
    value: 0.60694533586502075
    value: -0.55625313520431519
    value: 0.45928007364273071
    value: 1.1463602781295776
    value: -0.31495797634124756
    value: -0.65815860033035278
    value: -0.072198852896690369
    value: -0.48601299524307251
    value: 1.2523250579833984
    value: 0.15266281366348267
    value: -0.51058071851730347
    value: 0.14589129388332367
    value: -0.065113864839077
    value: -0.82813489437103271
    value: -0.088485322892665863
    value: -0.093692004680633545
    value: 0.17508910596370697
    value: 0.085454389452934265
    value: -0.036861639469861984
    value: -0.37335056066513062
    value: -0.93331336975097656
    value: 1.0161639451980591
    value: -0.85178059339523315
    value: 0.16465844213962555
    value: -0.30516651272773743
    value: 0.77967363595962524
    value: -1.0934281349182129
    value: -0.46843919157981873
    value: 0.23266731202602386
    value: -0.91115432977676392
    value: 1.1776360273361206
    value: -0.14061595499515533
    value: 1.7196305990219116
    value: 0.88505077362060547
    value: -0.66582763195037842
    value: -1.0921844244003296
    value: -0.55773293972015381
    value: -1.3714858293533325
    value: -0.63851648569107056
    value: 0.039618555456399918
    value: -0.56948298215866089
    value: -0.386549174785614
    value: -0.57862961292266846
    value: 0.00042083923472091556
    value: 1.2337731122970581
    value: -1.172148585319519
    value: -0.63311725854873657
    value: -0.2320488840341568
    value: -1.3612120151519775
    value: -0.27439695596694946
    value: -0.65633958578109741
    value: -0.90945452451705933
    value: 0.99561280012130737
    value: 0.34582152962684631
    value: 0.18455794453620911
    value: 1.0669331550598145
    value: 0.41529515385627747
    value: 1.3609752655029297
    value: -1.6335160732269287
    value: -1.6427403688430786
    value: -0.19609163701534271
    value: -0.023230478167533875
    value: 0.025110412389039993
    value: -0.0006084316992200911
    value: -0.52254593372344971
    value: -0.13928794860839844
    value: -0.51460999250411987
    value: -1.8672541379928589
    value: -0.061992019414901733
    value: -0.54030638933181763
    value: 0.70388144254684448
    value: -0.14376050233840942
    value: -0.41162705421447754
    value: -0.58780854940414429
    value: 0.13547109067440033
    value: 0.34111091494560242
    value: -0.20590144395828247
    value: -0.48953157663345337
    value: -0.4576629102230072
    value: 0.3524969220161438
    value: 0.60579735040664673
    value: -0.97761911153793335
    value: -0.43236297369003296
    value: 0.15454950928688049
    value: -0.56251949071884155
    value: 0.88326102495193481
    value: -1.0333240032196045
    value: -0.091033145785331726
    value: 0.27995756268501282
    value: 0.85947549343109131
    value: 0.069914117455482483
    value: 0.19139301776885986
    value: 0.84867912530899048
    value: -0.067708112299442291
    value: -0.9504094123840332
    value: 1.3516247272491455
    value: 0.94304192066192627
    value: 0.30440309643745422
    value: 0.901656985282898
    value: 0.82250028848648071
    value: -0.4675121009349823
    value: -2.358196496963501
    value: -0.29511845111846924
    value: 0.12493155151605606
    value: 0.628790557384491
    value: 0.004813680425286293
    value: 0.54670697450637817
    value: 1.0570240020751953
    value: 0.76768636703491211
    value: 0.002188720041885972
    value: 1.0993828773498535
    value: -0.54771369695663452
    value: -0.40614870190620422
    value: -1.1902085542678833
    value: -0.86351746320724487
    value: 0.090313725173473358
    value: -0.24709655344486237
    value: 0.22054190933704376
    value: 0.26783099770545959
    value: 0.40868785977363586
    value: 0.087776675820350647
    value: -1.3164709806442261
    value: -0.73581695556640625
    value: -1.2587006092071533
    value: -0.28689175844192505
    value: -0.0501885749399662
    value: -0.18470481038093567
    value: -0.7513880729675293
    value: -1.6806529760360718
    value: -2.034785270690918
    value: -0.78795921802520752
    value: 0.15182636678218842
    value: -0.34135353565216064
