num_layers: 122
quant_type: SYMMETRIC
calib_type: PERTENSOR
layers {
  layer_name: "input"
  layer_type: "TIDL_DataLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 255
    size: 1
    element_type: 6
    scale: 1
    zero_point: 0
  }
}
layers {
  layer_name: "input_netFormat"
  layer_type: "TIDL_DataConvertLayer"
  bit_depth: 4
  outputs {
    min: 0
    max: 254.999954
    size: 1
    element_type: 3
    scale: 128
    zero_point: 0
  }
}
layers {
  layer_name: "1"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: -54.1153221
    max: 53.2705612
    size: 1
    element_type: 3
    scale: 534.5943603515625
    zero_point: 0
  }
  weights {
    min: -0.119716942
    max: 0.104723647
    size: 1
    element_type: 3
    scale: 273712.3125
    zero_point: 0
  }
  bias {
    min: -2.79657865
    max: 3.61954331
    size: 12
    element_type: 0
    scale: 9053.076171875
    zero_point: 0
    value: 0.6337553858757019
    value: -0.84179353713989258
    value: -0.9140167236328125
    value: 0.77935332059860229
    value: -2.7965786457061768
    value: 1.3470885753631592
    value: 1.4374600648880005
    value: 2.56714129447937
    value: 0.33597469329833984
    value: 3.6195433139801025
    value: -1.3843351602554321
    value: 0.10359904170036316
  }
}
layers {
  layer_name: "3"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 41.8337822
    size: 1
    element_type: 2
    scale: 1462.85888671875
    zero_point: 0
  }
  weights {
    min: -0.730889857
    max: 0.551953316
    size: 1
    element_type: 3
    scale: 44833.01953125
    zero_point: 0
  }
  bias {
    min: -1.1914829
    max: 2.78222704
    size: 32
    element_type: 0
    scale: 11777.615234375
    zero_point: 0
    value: 1.0867882966995239
    value: -0.11756005883216858
    value: -0.35119229555130005
    value: 0.83356118202209473
    value: -0.10304941236972809
    value: 0.66409528255462646
    value: -0.1248578205704689
    value: -0.10248880833387375
    value: -0.31663069128990173
    value: 0.70355695486068726
    value: -0.17070510983467102
    value: -0.21596084535121918
    value: 0.66728991270065308
    value: 0.79022473096847534
    value: 0.341686487197876
    value: 0.017386045306921005
    value: -0.11314786225557327
    value: -1.1914829015731812
    value: -0.264787495136261
    value: 0.6082497239112854
    value: 2.7822270393371582
    value: 0.74672520160675049
    value: -0.25102886557579041
    value: 2.336423397064209
    value: 1.4792041778564453
    value: 0.49811932444572449
    value: -0.069039039313793182
    value: -0.20316256582736969
    value: -0.11936910450458527
    value: 1.1422748565673828
    value: -0.20182335376739502
    value: -0.35494786500930786
  }
}
layers {
  layer_name: "5"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 24.9402
    size: 1
    element_type: 2
    scale: 1651.0802001953125
    zero_point: 0
  }
  weights {
    min: -0.443000555
    max: 0.306910276
    size: 1
    element_type: 3
    scale: 73968.3046875
    zero_point: 0
  }
  bias {
    min: -2.59972405
    max: 2.83499742
    size: 64
    element_type: 0
    scale: 11558.3876953125
    zero_point: 0
    value: -0.25313577055931091
    value: 0.59863001108169556
    value: 2.8349974155426025
    value: 1.3069926500320435
    value: 1.9749159812927246
    value: 0.18477296829223633
    value: 1.4548394680023193
    value: 1.1421563625335693
    value: 0.623071014881134
    value: 1.5353057384490967
    value: 1.5031838417053223
    value: 0.571175754070282
    value: 0.70397520065307617
    value: 1.1396768093109131
    value: -0.32578113675117493
    value: -0.37154707312583923
    value: 0.9915241003036499
    value: 0.98345690965652466
    value: 0.14223664999008179
    value: -0.075513832271099091
    value: 1.4419128894805908
    value: 0.56934791803359985
    value: -0.61458981037139893
    value: -0.170126810669899
    value: -0.52737563848495483
    value: -0.44559651613235474
    value: -1.2617725133895874
    value: 0.058026596903800964
    value: -2.5997240543365479
    value: 0.46222040057182312
    value: -0.517930805683136
    value: -0.73747032880783081
    value: 0.14455555379390717
    value: 0.76199126243591309
    value: 2.5092678070068359
    value: 0.33151876926422119
    value: 1.0390549898147583
    value: 0.49201700091362
    value: 0.459844708442688
    value: 0.12908445298671722
    value: -0.067947022616863251
    value: 2.8200092315673828
    value: 0.22594046592712402
    value: 2.4221382141113281
    value: -0.33651474118232727
    value: 0.4878324568271637
    value: 0.11391466110944748
    value: 0.0090109296143054962
    value: -0.47078344225883484
    value: -0.025820838287472725
    value: 0.72478514909744263
    value: 0.50875341892242432
    value: -0.13570219278335571
    value: 0.23256899416446686
    value: -0.49051514267921448
    value: 0.978705644607544
    value: -0.63473337888717651
    value: -0.00076828536111861467
    value: 0.0054066050797700882
    value: 0.34766194224357605
    value: 0.81798171997070312
    value: -0.52867239713668823
    value: 1.505362868309021
    value: 1.0057430267333984
  }
}
layers {
  layer_name: "7"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 13.109355
    size: 1
    element_type: 2
    scale: 3709.444580078125
    zero_point: 0
  }
  weights {
    min: -0.890203476
    max: 0.688850701
    size: 1
    element_type: 3
    scale: 36809.5625
    zero_point: 0
  }
  bias {
    min: -0.45598352
    max: 2.60330629
    size: 32
    element_type: 0
    scale: 12587.0703125
    zero_point: 0
    value: 1.6866875886917114
    value: 1.0008822679519653
    value: 2.331871509552002
    value: 0.23080253601074219
    value: 1.333219051361084
    value: -0.36925163865089417
    value: -0.17502281069755554
    value: 0.45907965302467346
    value: 0.9718366265296936
    value: 0.910255491733551
    value: 0.72549158334732056
    value: -0.17895208299160004
    value: 2.6033062934875488
    value: -0.45598351955413818
    value: 1.3516807556152344
    value: -0.44616010785102844
    value: 1.3226637840270996
    value: 1.615882396697998
    value: -0.1989893764257431
    value: 1.4035000801086426
    value: 1.4622925519943237
    value: 0.025143852457404137
    value: 0.98803836107254028
    value: 2.0103750228881836
    value: 0.40010538697242737
    value: 1.7120167016983032
    value: 1.2424031496047974
    value: 1.5680283308029175
    value: 0.77383279800415039
    value: 1.7893120050430298
    value: -0.28575176000595093
    value: 0.61302965879440308
  }
}
layers {
  layer_name: "9"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 8.86521339
    size: 1
    element_type: 2
    scale: 6622.841796875
    zero_point: 0
  }
  weights {
    min: -0.498601705
    max: 0.490332931
    size: 1
    element_type: 3
    scale: 65719.7890625
    zero_point: 0
  }
  bias {
    min: -0.251887083
    max: 2.92412233
    size: 32
    element_type: 0
    scale: 11206.09765625
    zero_point: 0
    value: 0.22870920598506927
    value: 1.1932015419006348
    value: 1.6409273147583008
    value: 1.0547375679016113
    value: 1.1434831619262695
    value: -0.25188708305358887
    value: 1.3552713394165039
    value: 1.4191781282424927
    value: 0.5133013129234314
    value: 1.5413442850112915
    value: 1.5475994348526
    value: -0.027439456433057785
    value: 0.61044532060623169
    value: 0.67619234323501587
    value: 0.80518615245819092
    value: 0.50691181421279907
    value: 0.87215906381607056
    value: 0.27507343888282776
    value: 1.0711477994918823
    value: -0.071789070963859558
    value: 1.3153164386749268
    value: 2.0977895259857178
    value: -0.16453024744987488
    value: 1.4524695873260498
    value: 1.0316259860992432
    value: 1.4839068651199341
    value: 1.0470044612884521
    value: 2.3566255569458008
    value: -0.04439767450094223
    value: 0.61415362358093262
    value: 2.9241223335266113
    value: 1.1386979818344116
  }
}
layers {
  layer_name: "11"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 12.786273
    size: 1
    element_type: 2
    scale: 2409.844970703125
    zero_point: 0
  }
  weights {
    min: -1.16391551
    max: 1.37412202
    size: 1
    element_type: 3
    scale: 23846.5
    zero_point: 0
  }
  bias {
    min: -3.1454072
    max: 5.09449625
    size: 32
    element_type: 0
    scale: 6432.0390625
    zero_point: 0
    value: 5.0944962501525879
    value: 3.4729104042053223
    value: 0.88231772184371948
    value: -1.4069173336029053
    value: 2.5755870342254639
    value: -0.018580446019768715
    value: 1.4249113798141479
    value: 1.2539058923721313
    value: -2.4310357570648193
    value: 2.4896461963653564
    value: -0.6887824535369873
    value: 3.5540637969970703
    value: -3.1454071998596191
    value: 0.48220854997634888
    value: 2.0225632190704346
    value: -1.8726774454116821
    value: 0.79177016019821167
    value: -2.68397855758667
    value: 0.16078874468803406
    value: -0.55985748767852783
    value: -0.086216934025287628
    value: 1.160630464553833
    value: 4.3047928810119629
    value: 1.5564714670181274
    value: 2.0241458415985107
    value: -0.24868105351924896
    value: -1.264686107635498
    value: 1.2516113519668579
    value: -0.43653753399848938
    value: 3.3099257946014404
    value: -1.2491559982299805
    value: 2.0412561893463135
  }
}
layers {
  layer_name: "13"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 13.444808
    size: 1
    element_type: 2
    scale: 4533.5126953125
    zero_point: 0
  }
  weights {
    min: -1.0631249
    max: 0.749325514
    size: 1
    element_type: 3
    scale: 30822.34375
    zero_point: 0
  }
  bias {
    min: -2.63982201
    max: 7.295012
    size: 32
    element_type: 0
    scale: 4491.83642578125
    zero_point: 0
    value: 0.31000679731369019
    value: -0.59364670515060425
    value: 0.08056718111038208
    value: 1.5506936311721802
    value: -1.1348294019699097
    value: 2.1971514225006104
    value: 0.45665338635444641
    value: 2.3425834178924561
    value: 4.300072193145752
    value: -0.62502008676528931
    value: -0.70713913440704346
    value: 0.059692643582820892
    value: -2.6398220062255859
    value: 1.2921630144119263
    value: 1.2904905080795288
    value: 0.61656767129898071
    value: 0.64442843198776245
    value: -0.030201779678463936
    value: 0.65923213958740234
    value: 2.29137921333313
    value: 0.87815225124359131
    value: 7.2950119972229
    value: 0.39709872007369995
    value: 1.6756201982498169
    value: 1.0394660234451294
    value: 1.6055533885955811
    value: 0.76356154680252075
    value: 0.55932557582855225
    value: -2.1216945648193359
    value: -0.72876065969467163
    value: 2.4880650043487549
    value: 0.26060417294502258
  }
}
layers {
  layer_name: "14"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 16.2447433
    size: 1
    element_type: 2
    scale: 2266.75634765625
    zero_point: 0
  }
}
layers {
  layer_name: "15"
  layer_type: "TIDL_ConcatLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 16.3368683
    size: 1
    element_type: 2
    scale: 2266.75634765625
    zero_point: 0
  }
}
layers {
  layer_name: "17"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 14.0784969
    size: 1
    element_type: 2
    scale: 3913.72900390625
    zero_point: 0
  }
  weights {
    min: -0.910501599
    max: 1.15836143
    size: 1
    element_type: 3
    scale: 28288.234375
    zero_point: 0
  }
  bias {
    min: -2.04771876
    max: 5.30090094
    size: 64
    element_type: 0
    scale: 6181.5908203125
    zero_point: 0
    value: 1.954627513885498
    value: 2.9120969772338867
    value: 0.37586048245429993
    value: 1.0347276926040649
    value: 3.1047666072845459
    value: 3.5565335750579834
    value: 1.5825549364089966
    value: 0.83170795440673828
    value: 0.67012810707092285
    value: -0.63967245817184448
    value: 0.49754804372787476
    value: 2.2667484283447266
    value: -0.5518643856048584
    value: 0.30760645866394043
    value: 1.6590578556060791
    value: 1.0538544654846191
    value: -0.25227949023246765
    value: 3.3097922801971436
    value: -0.26838183403015137
    value: -0.13813091814517975
    value: 0.73534512519836426
    value: -0.5810776948928833
    value: 0.33125147223472595
    value: 2.2761085033416748
    value: 0.300008624792099
    value: 4.4213647842407227
    value: 2.9645395278930664
    value: 1.0384397506713867
    value: 2.66190242767334
    value: -0.38449019193649292
    value: 1.0293359756469727
    value: 2.9019343852996826
    value: 2.0213961601257324
    value: 2.1331741809844971
    value: -0.3287377655506134
    value: 1.5309622287750244
    value: 1.4752558469772339
    value: 2.65291690826416
    value: 2.0247933864593506
    value: 1.4127967357635498
    value: 0.627158522605896
    value: 2.6141610145568848
    value: 2.2403314113616943
    value: 2.3116142749786377
    value: 0.4258485734462738
    value: -1.581154465675354
    value: 1.5879533290863037
    value: 5.300900936126709
    value: -2.0477187633514404
    value: 2.5748693943023682
    value: 0.7523808479309082
    value: 3.9308269023895264
    value: 1.8999875783920288
    value: 0.35062915086746216
    value: 1.7077263593673706
    value: -0.74975311756134033
    value: 2.3118412494659424
    value: 1.07822847366333
    value: 3.220008373260498
    value: -1.2745771408081055
    value: -0.99898546934127808
    value: 1.5652133226394653
    value: 0.73047763109207153
    value: 3.8304300308227539
  }
}
layers {
  layer_name: "19"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 11.7938967
    size: 1
    element_type: 2
    scale: 5134.96484375
    zero_point: 0
  }
  weights {
    min: -0.38108626
    max: 0.335589379
    size: 1
    element_type: 3
    scale: 85985.78125
    zero_point: 0
  }
  bias {
    min: -1.91463077
    max: 2.36977887
    size: 128
    element_type: 0
    scale: 13827.4501953125
    zero_point: 0
    value: -0.035878956317901611
    value: 0.31341037154197693
    value: 0.33484473824501038
    value: 0.48657909035682678
    value: -0.40611842274665833
    value: 1.0430784225463867
    value: 1.3000156879425049
    value: 1.7640218734741211
    value: 0.50600171089172363
    value: 0.50614827871322632
    value: 0.4553622305393219
    value: 0.53272497653961182
    value: 0.31426918506622314
    value: -1.9146307706832886
    value: 0.77162712812423706
    value: -0.039761487394571304
    value: 0.64026761054992676
    value: 0.30924531817436218
    value: 0.76626628637313843
    value: -0.26204803586006165
    value: 1.1739073991775513
    value: 1.088392972946167
    value: 0.66703373193740845
    value: 0.71806484460830688
    value: 0.79145938158035278
    value: 0.90424174070358276
    value: 0.86756992340087891
    value: 1.2679790258407593
    value: 0.76205247640609741
    value: 0.58672571182250977
    value: -0.464607834815979
    value: -0.98919260501861572
    value: -1.6195456981658936
    value: 1.2835112810134888
    value: 1.0141185522079468
    value: 0.21144339442253113
    value: 0.19382084906101227
    value: 0.44285327196121216
    value: -0.82390564680099487
    value: -0.68079447746276855
    value: 0.23216331005096436
    value: 0.12334094941616058
    value: 1.8695216178894043
    value: 0.68789535760879517
    value: -0.44583860039711
    value: 0.41178542375564575
    value: 0.66816520690917969
    value: -0.070580251514911652
    value: -0.13359551131725311
    value: 1.0654253959655762
    value: -0.464202880859375
    value: 1.0029643774032593
    value: -0.068427056074142456
    value: 0.61239135265350342
    value: 1.1713031530380249
    value: 0.97050124406814575
    value: -0.97534668445587158
    value: 0.48457589745521545
    value: 0.5580209493637085
    value: -0.48074018955230713
    value: 0.83162558078765869
    value: 1.2500628232955933
    value: 0.24037753045558929
    value: 0.60660916566848755
    value: 0.64533489942550659
    value: 0.507120668888092
    value: 0.52224719524383545
    value: 0.024077706038951874
    value: 0.430405855178833
    value: 0.78605920076370239
    value: -0.91034561395645142
    value: 0.71286517381668091
    value: -0.5911325216293335
    value: 1.1293163299560547
    value: -0.58142340183258057
    value: 0.2157568633556366
    value: -0.29277774691581726
    value: 1.3803410530090332
    value: -0.059789393097162247
    value: -0.42015412449836731
    value: -0.24802057445049286
    value: 0.055829823017120361
    value: -0.63286817073822021
    value: 0.15992178022861481
    value: 1.0487035512924194
    value: 1.6126338243484497
    value: 0.84231030941009521
    value: -0.18342992663383484
    value: 2.3697788715362549
    value: -0.42091390490531921
    value: -0.37888601422309875
    value: 0.13374908268451691
    value: -0.54159235954284668
    value: 0.82424908876419067
    value: 0.7901729941368103
    value: 0.096108689904212952
    value: -0.65501940250396729
    value: -0.27115648984909058
    value: -0.24375398457050323
    value: 0.554946780204773
    value: 0.33735662698745728
    value: 1.7778410911560059
    value: 0.42784017324447632
    value: -0.46327757835388184
    value: 0.072837159037590027
    value: 0.122114397585392
    value: 0.67883443832397461
    value: -0.1825336366891861
    value: 0.94503623247146606
    value: 1.0892972946166992
    value: -0.0916823148727417
    value: 1.1620805263519287
    value: 1.1510591506958008
    value: 1.02188241481781
    value: 0.94903165102005
    value: 1.3696244955062866
    value: 1.0951879024505615
    value: 0.31201407313346863
    value: 1.4098169803619385
    value: 1.3020191192626953
    value: -0.035200778394937515
    value: -0.6046525239944458
    value: -0.38887351751327515
    value: -0.267699271440506
    value: -0.55016422271728516
    value: -0.39096441864967346
    value: 0.53073364496231079
    value: 1.0482264757156372
  }
}
layers {
  layer_name: "21"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 18.5007
    size: 1
    element_type: 2
    scale: 2077.77880859375
    zero_point: 0
  }
  weights {
    min: -1.17556965
    max: 1.23568618
    size: 1
    element_type: 3
    scale: 26518.060546875
    zero_point: 0
  }
  bias {
    min: -5.43995619
    max: 2.92782378
    size: 64
    element_type: 0
    scale: 6023.578125
    zero_point: 0
    value: -3.0363192558288574
    value: -0.086527593433856964
    value: 1.4336742162704468
    value: -0.95418167114257812
    value: -2.2996950149536133
    value: 1.7911249399185181
    value: 1.5054931640625
    value: -1.5678476095199585
    value: 0.57349151372909546
    value: 0.63860875368118286
    value: 0.42723298072814941
    value: 1.1052173376083374
    value: 0.43185064196586609
    value: -0.46179652214050293
    value: 2.3709261417388916
    value: -1.127467155456543
    value: 2.9278237819671631
    value: -0.88892781734466553
    value: 0.33386635780334473
    value: 0.93711459636688232
    value: -1.5084149837493896
    value: -0.682553768157959
    value: 1.1415627002716064
    value: 0.65966141223907471
    value: -1.0656158924102783
    value: 0.87498277425765991
    value: -0.96877807378768921
    value: -0.5308377742767334
    value: -0.45874890685081482
    value: 1.2935720682144165
    value: -0.86743462085723877
    value: 0.89022916555404663
    value: -0.69304084777832031
    value: -0.2455151230096817
    value: 1.5997235774993896
    value: 0.5738060474395752
    value: 2.7657074928283691
    value: 0.10264966636896133
    value: 1.5630234479904175
    value: -0.14004115760326385
    value: -0.033968854695558548
    value: 0.40804809331893921
    value: 1.746619701385498
    value: 0.98222953081130981
    value: 2.7081029415130615
    value: -0.1524786651134491
    value: 0.23217301070690155
    value: 2.3197891712188721
    value: 0.025885535404086113
    value: 2.8347876071929932
    value: -0.60545921325683594
    value: -5.4399561882019043
    value: 0.27323958277702332
    value: -1.2233057022094727
    value: 0.51512598991394043
    value: 0.3390679657459259
    value: 1.4989980459213257
    value: 0.66770529747009277
    value: 2.07804274559021
    value: 0.18330091238021851
    value: 0.012202342972159386
    value: -0.79803097248077393
    value: -1.1007649898529053
    value: -0.13274084031581879
  }
}
layers {
  layer_name: "23"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 5.7193265
    size: 1
    element_type: 2
    scale: 4767.3369140625
    zero_point: 0
  }
  weights {
    min: -0.322558075
    max: 0.538556933
    size: 1
    element_type: 3
    scale: 60844.078125
    zero_point: 0
  }
  bias {
    min: -0.580856
    max: 2.16893935
    size: 64
    element_type: 0
    scale: 15107.8447265625
    zero_point: 0
    value: 0.77822744846343994
    value: 0.63284558057785034
    value: 0.23310121893882751
    value: -0.2830122709274292
    value: 0.51080983877182007
    value: -0.2190852016210556
    value: 1.083166241645813
    value: 1.6334741115570068
    value: 1.2638047933578491
    value: 1.8859741687774658
    value: 0.90770787000656128
    value: 1.1824994087219238
    value: 0.86740380525588989
    value: 1.0719877481460571
    value: -0.3999485969543457
    value: 0.11092834174633026
    value: 1.2684444189071655
    value: 0.38362798094749451
    value: 0.99368417263031006
    value: 0.41951373219490051
    value: 0.60558134317398071
    value: -0.2771434485912323
    value: 0.62387126684188843
    value: -0.20475170016288757
    value: -0.18894428014755249
    value: 0.830989420413971
    value: 0.6430249810218811
    value: 0.69957834482192993
    value: 0.078856490552425385
    value: 0.034365762025117874
    value: 1.5854289531707764
    value: 0.8342403769493103
    value: -0.20762936770915985
    value: 0.63464206457138062
    value: 0.95297354459762573
    value: 0.34960299730300903
    value: 0.98989373445510864
    value: 0.65397906303405762
    value: 0.88129514455795288
    value: 2.1689393520355225
    value: -0.34277418255805969
    value: 0.14233668148517609
    value: 1.0845781564712524
    value: 0.16875149309635162
    value: 1.8949778079986572
    value: 1.8985671997070312
    value: -0.58085602521896362
    value: 1.69968843460083
    value: 0.69610005617141724
    value: 0.21504443883895874
    value: 0.8788444995880127
    value: 0.82434940338134766
    value: 0.070479743182659149
    value: 0.21177390217781067
    value: -0.128415048122406
    value: 0.16915100812911987
    value: 0.68488949537277222
    value: 0.86768883466720581
    value: 1.2352334260940552
    value: 1.6437126398086548
    value: 0.09158632904291153
    value: -0.244593545794487
    value: 1.9558894634246826
    value: -0.10222676396369934
  }
}
layers {
  layer_name: "25"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 8.02320671
    size: 1
    element_type: 2
    scale: 2187.816650390625
    zero_point: 0
  }
  weights {
    min: -0.926752388
    max: 1.08951926
    size: 1
    element_type: 3
    scale: 30075.650390625
    zero_point: 0
  }
  bias {
    min: -3.90014458
    max: 3.67729902
    size: 64
    element_type: 0
    scale: 8401.740234375
    zero_point: 0
    value: 1.2467367649078369
    value: 0.58147108554840088
    value: 1.3078987598419189
    value: -0.039266400039196014
    value: -0.47187858819961548
    value: 0.78789865970611572
    value: 0.019104210659861565
    value: 0.055881019681692123
    value: -0.619812548160553
    value: 0.096094623208045959
    value: 3.6772990226745605
    value: 1.503516674041748
    value: 1.6183297634124756
    value: -0.67928999662399292
    value: 0.60844528675079346
    value: -0.49827668070793152
    value: 0.552323579788208
    value: -0.81745845079422
    value: 3.4695422649383545
    value: -2.9706203937530518
    value: -1.0805473327636719
    value: 1.8783714771270752
    value: 2.2626042366027832
    value: 1.1023557186126709
    value: -1.3726916313171387
    value: 1.2192524671554565
    value: 0.021414533257484436
    value: -1.2240465879440308
    value: 1.5580536127090454
    value: -3.25185227394104
    value: 1.6144448518753052
    value: -3.9001445770263672
    value: 1.3659476041793823
    value: 1.2374275922775269
    value: 1.6870954036712646
    value: 1.0831674337387085
    value: -1.4650089740753174
    value: 1.4221484661102295
    value: -2.8617405891418457
    value: 2.1284887790679932
    value: -0.020548578351736069
    value: 2.7181048393249512
    value: 2.6913144588470459
    value: -0.79753255844116211
    value: 1.3329000473022461
    value: -2.1343166828155518
    value: 0.70373141765594482
    value: -1.4480221271514893
    value: 3.1774537563323975
    value: -0.542165219783783
    value: 1.95927894115448
    value: 1.3640764951705933
    value: 2.0598623752593994
    value: 1.4842815399169922
    value: -1.9997484683990479
    value: -2.3671536445617676
    value: -0.094072639942169189
    value: 1.067346453666687
    value: -1.579011082649231
    value: 1.7410274744033813
    value: 1.1349946260452271
    value: 0.16596882045269012
    value: -2.6620011329650879
    value: -0.13085584342479706
  }
}
layers {
  layer_name: "27"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 5.03747606
    size: 1
    element_type: 2
    scale: 11780.7841796875
    zero_point: 0
  }
  weights {
    min: -0.246374428
    max: 0.371421218
    size: 1
    element_type: 3
    scale: 88223.28125
    zero_point: 0
  }
  bias {
    min: -1.1890291
    max: 3.36627102
    size: 64
    element_type: 0
    scale: 9734.212890625
    zero_point: 0
    value: -0.096447110176086426
    value: 0.19477179646492004
    value: -0.2956099808216095
    value: 0.19143523275852203
    value: -0.097736775875091553
    value: 0.49383533000946045
    value: 0.340524822473526
    value: -0.97202789783477783
    value: 0.46202149987220764
    value: 0.52756631374359131
    value: 0.10728953033685684
    value: 0.020346364006400108
    value: -0.10071563720703125
    value: 0.85375219583511353
    value: -0.37297061085700989
    value: 0.4292331337928772
    value: -0.05855250358581543
    value: -0.10054691135883331
    value: -0.37190687656402588
    value: -0.59131777286529541
    value: 0.15659439563751221
    value: -0.49766877293586731
    value: -0.27112579345703125
    value: -0.0656634047627449
    value: -0.69389212131500244
    value: 0.46572652459144592
    value: -0.017990875989198685
    value: -1.1890290975570679
    value: 0.49389052391052246
    value: -0.28605207800865173
    value: -0.44225090742111206
    value: 0.97762501239776611
    value: 0.38651648163795471
    value: -0.25048762559890747
    value: -0.73240190744400024
    value: 0.47805324196815491
    value: -0.14295752346515656
    value: 0.5715404748916626
    value: -0.29108470678329468
    value: -0.24047784507274628
    value: 0.055376742035150528
    value: 0.06585095077753067
    value: -0.24784088134765625
    value: 0.44882863759994507
    value: -0.45257553458213806
    value: 0.12971359491348267
    value: -0.26059731841087341
    value: 3.3662710189819336
    value: 1.0197335481643677
    value: -0.22430010139942169
    value: -0.41812679171562195
    value: 0.1261100172996521
    value: -0.44920554757118225
    value: 0.11151379346847534
    value: 0.13061030209064484
    value: -0.053349517285823822
    value: -0.55117881298065186
    value: 0.52072888612747192
    value: -0.48196631669998169
    value: 0.094148814678192139
    value: -0.079764187335968018
    value: -0.58911019563674927
    value: 0.29588869214057922
    value: 0.35138887166976929
  }
}
layers {
  layer_name: "28"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 7.76418209
    size: 1
    element_type: 2
    scale: 2383.66845703125
    zero_point: 0
  }
}
layers {
  layer_name: "30"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 8.25502491
    size: 1
    element_type: 2
    scale: 4743.392578125
    zero_point: 0
  }
  weights {
    min: -0.764962792
    max: 1.00504792
    size: 1
    element_type: 3
    scale: 32603.419921875
    zero_point: 0
  }
  bias {
    min: -3.398803
    max: 7.26194
    size: 64
    element_type: 0
    scale: 4512.29296875
    zero_point: 0
    value: -1.4965646266937256
    value: -0.3919292688369751
    value: 1.2427600622177124
    value: 0.20045286417007446
    value: -0.039441879838705063
    value: 0.80724436044692993
    value: 0.60534679889678955
    value: -1.1277494430541992
    value: -1.6991274356842041
    value: -3.2288720607757568
    value: 3.8172388076782227
    value: -1.4185383319854736
    value: 0.99339723587036133
    value: -0.38755178451538086
    value: 0.614916205406189
    value: 1.7585313320159912
    value: 1.7424410581588745
    value: 1.3473247289657593
    value: 0.85467630624771118
    value: -0.10379594564437866
    value: 0.14549729228019714
    value: -3.2656323909759521
    value: -0.034686334431171417
    value: -0.49630019068717957
    value: 0.789089560508728
    value: -0.58820044994354248
    value: 1.769497275352478
    value: 2.9309241771698
    value: 0.90851050615310669
    value: 2.0825097560882568
    value: 1.4333052635192871
    value: 7.2619400024414062
    value: -1.5595446825027466
    value: 0.98072922229766846
    value: -2.3633723258972168
    value: 0.44683113694190979
    value: 2.2043962478637695
    value: 2.8815047740936279
    value: -0.96034115552902222
    value: 3.24273943901062
    value: 0.19652314484119415
    value: 0.098386809229850769
    value: 2.1692516803741455
    value: 0.36156859993934631
    value: 0.245439350605011
    value: 0.83342689275741577
    value: 0.628082275390625
    value: 0.10560041666030884
    value: 2.0797419548034668
    value: 3.4059112071990967
    value: -2.0445482730865479
    value: 2.0357940196990967
    value: 1.3723329305648804
    value: 2.4243178367614746
    value: -3.3988029956817627
    value: 0.15900386869907379
    value: 0.853564441204071
    value: -0.23961351811885834
    value: 2.6144180297851562
    value: 0.67756938934326172
    value: 3.6202266216278076
    value: 1.8957817554473877
    value: 2.9460675716400146
    value: -2.6537384986877441
  }
}
layers {
  layer_name: "32"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 8.38552475
    size: 1
    element_type: 2
    scale: 4679.44921875
    zero_point: 0
  }
  weights {
    min: -0.298352033
    max: 0.506832361
    size: 1
    element_type: 3
    scale: 64652.5390625
    zero_point: 0
  }
  bias {
    min: -1.13854122
    max: 2.30315113
    size: 64
    element_type: 0
    scale: 14227.4638671875
    zero_point: 0
    value: 1.0596274137496948
    value: 0.83716773986816406
    value: 0.36279091238975525
    value: 0.037808049470186234
    value: 0.45752573013305664
    value: 0.44862571358680725
    value: 0.0087537150830030441
    value: -0.56247138977050781
    value: 0.38210418820381165
    value: -0.14755217730998993
    value: 0.57364028692245483
    value: 0.34015235304832458
    value: -0.32507511973381042
    value: -0.42548751831054688
    value: -0.95884835720062256
    value: 1.5652177333831787
    value: 0.055421020835638046
    value: 0.18524128198623657
    value: -0.9809342622756958
    value: -0.40525570511817932
    value: -0.57927399873733521
    value: -0.056558888405561447
    value: -1.1385412216186523
    value: -0.1014537513256073
    value: 0.41022953391075134
    value: 0.80453944206237793
    value: 0.096075683832168579
    value: 0.28952294588088989
    value: 0.60096627473831177
    value: -0.49642100930213928
    value: 0.057927355170249939
    value: 1.6123553514480591
    value: 0.89865630865097046
    value: -0.37928110361099243
    value: -0.46471133828163147
    value: 1.456296443939209
    value: -0.39943620562553406
    value: 0.39247876405715942
    value: 0.18729928135871887
    value: 0.25215789675712585
    value: -0.019643926993012428
    value: 0.92594230175018311
    value: -0.014115278609097004
    value: 0.99804764986038208
    value: -0.018873225897550583
    value: 0.78162264823913574
    value: -0.67413997650146484
    value: 2.3031511306762695
    value: -0.30833235383033752
    value: -0.16632984578609467
    value: -0.81099128723144531
    value: 0.035454388707876205
    value: 0.52258789539337158
    value: -1.0068861246109009
    value: 0.91522103548049927
    value: -0.018423009663820267
    value: 0.82931989431381226
    value: 0.80227071046829224
    value: 0.12844783067703247
    value: 0.080870173871517181
    value: -0.064772263169288635
    value: -0.015103993937373161
    value: -0.27656731009483337
    value: -0.52755576372146606
  }
}
layers {
  layer_name: "33"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 10.336628
    size: 1
    element_type: 2
    scale: 4767.3369140625
    zero_point: 0
  }
}
layers {
  layer_name: "35"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 8.36948395
    size: 1
    element_type: 2
    scale: 3302.439453125
    zero_point: 0
  }
  weights {
    min: -0.721790195
    max: 0.714689314
    size: 1
    element_type: 3
    scale: 45398.234375
    zero_point: 0
  }
  bias {
    min: -2.48011088
    max: 3.34304118
    size: 64
    element_type: 0
    scale: 9801.853515625
    zero_point: 0
    value: -2.2371582984924316
    value: 1.6247237920761108
    value: 0.077834025025367737
    value: -1.764190673828125
    value: 1.2637770175933838
    value: -0.38170787692070007
    value: 0.3551868200302124
    value: 1.12311851978302
    value: 0.7439192533493042
    value: -0.072274371981620789
    value: 1.9600820541381836
    value: -0.30395066738128662
    value: 0.62947112321853638
    value: -1.5033973455429077
    value: -0.28872591257095337
    value: 0.31232348084449768
    value: -0.054683435708284378
    value: 2.7052769660949707
    value: 3.3430411815643311
    value: 1.0917730331420898
    value: -0.0733078271150589
    value: -1.0629134178161621
    value: 1.8718400001525879
    value: -1.6751995086669922
    value: -0.865124523639679
    value: 1.6164001226425171
    value: 0.3143886923789978
    value: -0.86021840572357178
    value: 2.1012966632843018
    value: 0.91289103031158447
    value: -0.35482320189476013
    value: -1.0409133434295654
    value: 0.088373839855194092
    value: -1.6409547328948975
    value: -1.4834206104278564
    value: -1.7405056953430176
    value: 2.9179174900054932
    value: 0.19039167463779449
    value: 1.6766308546066284
    value: -0.07267722487449646
    value: 2.1226868629455566
    value: 0.0717829242348671
    value: -2.4801108837127686
    value: 1.1318987607955933
    value: -0.68356335163116455
    value: 1.2108359336853027
    value: 1.5273628234863281
    value: -0.35056370496749878
    value: -0.4300672709941864
    value: 1.5411958694458008
    value: 2.5524859428405762
    value: 0.709287703037262
    value: 1.6383126974105835
    value: -1.3173362016677856
    value: 0.24223220348358154
    value: 3.1597256660461426
    value: 2.9767210483551025
    value: -0.97699475288391113
    value: 0.1677287220954895
    value: 1.2433321475982666
    value: -1.5286917686462402
    value: 1.0372070074081421
    value: -0.048359367996454239
    value: -0.29144859313964844
  }
}
layers {
  layer_name: "37"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 11.9467649
    size: 1
    element_type: 2
    scale: 3382.30712890625
    zero_point: 0
  }
  weights {
    min: -0.561954379
    max: 0.976386666
    size: 1
    element_type: 3
    scale: 33560.4765625
    zero_point: 0
  }
  bias {
    min: -2.08779526
    max: 9.02404
    size: 64
    element_type: 0
    scale: 3631.189453125
    zero_point: 0
    value: -2.0877952575683594
    value: 0.27827847003936768
    value: -0.034017797559499741
    value: 0.59746426343917847
    value: -1.0411200523376465
    value: 1.2754113674163818
    value: 0.67618507146835327
    value: 2.7978436946868896
    value: 1.4751366376876831
    value: -0.0097409598529338837
    value: 0.36723878979682922
    value: 0.53219664096832275
    value: 2.2239499092102051
    value: -0.0601687952876091
    value: -0.33182743191719055
    value: 0.12339438498020172
    value: 0.69112914800643921
    value: -0.016081904992461205
    value: -0.23644384741783142
    value: 0.7576864361763
    value: -0.91487580537796021
    value: -0.73654383420944214
    value: 1.9900281429290771
    value: -0.62031996250152588
    value: -0.7211148738861084
    value: 1.4125304222106934
    value: 0.47987186908721924
    value: 3.0349483489990234
    value: 0.7577173113822937
    value: 1.4108693599700928
    value: 0.67388451099395752
    value: 0.94747120141983032
    value: 0.798784613609314
    value: 0.8731846809387207
    value: -0.48399466276168823
    value: 0.18023471534252167
    value: -0.10919103771448135
    value: -0.5164945125579834
    value: 0.88057821989059448
    value: 2.9375879764556885
    value: -1.2370462417602539
    value: -0.89790743589401245
    value: 0.66492938995361328
    value: 0.306433767080307
    value: 1.2199620008468628
    value: 9.0240402221679688
    value: -0.2318217009305954
    value: 2.413933277130127
    value: -0.62605100870132446
    value: 1.1790858507156372
    value: 0.11877919733524323
    value: -0.36350846290588379
    value: 1.1011505126953125
    value: 0.41487810015678406
    value: 0.4618874192237854
    value: -0.57676756381988525
    value: -0.51319026947021484
    value: 0.005866058636456728
    value: -0.55202215909957886
    value: -1.6891548633575439
    value: -0.3494378924369812
    value: 1.8789159059524536
    value: 0.72079777717590332
    value: 0.8255428671836853
  }
}
layers {
  layer_name: "38"
  layer_type: "TIDL_EltWiseLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 16.2498016
    size: 1
    element_type: 2
    scale: 3382.30712890625
    zero_point: 0
  }
}
layers {
  layer_name: "39"
  layer_type: "TIDL_ConcatLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 19.4721069
    size: 1
    element_type: 2
    scale: 2077.77880859375
    zero_point: 0
  }
}
layers {
  layer_name: "41"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 13.1515245
    size: 1
    element_type: 2
    scale: 3361.322998046875
    zero_point: 0
  }
  weights {
    min: -0.618143141
    max: 0.504609287
    size: 1
    element_type: 3
    scale: 53010.375
    zero_point: 0
  }
  bias {
    min: -3.22470236
    max: 4.10941601
    size: 128
    element_type: 0
    scale: 7973.88232421875
    zero_point: 0
    value: 0.63967382907867432
    value: 0.5128522515296936
    value: -0.22222357988357544
    value: 2.084975004196167
    value: 0.18336240947246552
    value: 0.33079284429550171
    value: 1.5649169683456421
    value: -0.12346237897872925
    value: -3.2247023582458496
    value: 1.0445886850357056
    value: -0.15562416613101959
    value: 0.40906360745429993
    value: -0.40117248892784119
    value: -0.11204613000154495
    value: 1.6339566707611084
    value: 1.4663280248641968
    value: 1.7276808023452759
    value: 0.68868887424468994
    value: -1.872204065322876
    value: 1.0611093044281006
    value: 0.51686197519302368
    value: 0.28421056270599365
    value: 1.4072847366333008
    value: 1.6668205261230469
    value: -1.3953973054885864
    value: 1.3789240121841431
    value: 1.0075832605361938
    value: 2.3068935871124268
    value: -0.32379654049873352
    value: 1.8188154697418213
    value: -0.42013821005821228
    value: 1.6474262475967407
    value: -0.26003506779670715
    value: 0.59500032663345337
    value: -2.3443212509155273
    value: 0.76965415477752686
    value: 2.1834096908569336
    value: 2.2797286510467529
    value: 0.51736384630203247
    value: 1.9494136571884155
    value: 0.39616721868515015
    value: -0.29268679022789
    value: -1.7921596765518188
    value: 1.0074783563613892
    value: 2.1213400363922119
    value: 1.0631701946258545
    value: 0.20792692899703979
    value: -0.14989621937274933
    value: 1.3736424446105957
    value: 0.3379027247428894
    value: 0.54936122894287109
    value: -1.3901565074920654
    value: -0.22290386259555817
    value: -0.13630087673664093
    value: 0.78913503885269165
    value: 0.66962432861328125
    value: -0.035885199904441833
    value: 0.654492199420929
    value: -0.35839328169822693
    value: 0.64969033002853394
    value: -0.010719890706241131
    value: 1.9750193357467651
    value: 1.7313448190689087
    value: -1.1853970289230347
    value: -3.0178124904632568
    value: 1.0751919746398926
    value: 2.3885781764984131
    value: 2.0662553310394287
    value: -0.43092983961105347
    value: 0.18392281234264374
    value: 1.0477389097213745
    value: 0.22771121561527252
    value: 0.74422204494476318
    value: 0.054824616760015488
    value: -0.85187625885009766
    value: -1.0919932126998901
    value: -1.6047061681747437
    value: 0.32939353585243225
    value: 0.63941007852554321
    value: 0.87381350994110107
    value: -0.0033233105204999447
    value: -1.1975154876708984
    value: -2.1346299648284912
    value: 1.4725182056427002
    value: 0.14558888971805573
    value: 1.7697068452835083
    value: 4.1094160079956055
    value: 0.76557821035385132
    value: -0.981291651725769
    value: -0.50390595197677612
    value: 0.40472626686096191
    value: 0.1896016001701355
    value: 0.79464817047119141
    value: 2.6330125331878662
    value: 0.17826656997203827
    value: -0.20146037638187408
    value: 1.0868408679962158
    value: -0.73542451858520508
    value: -2.3147592544555664
    value: 0.2038826048374176
    value: -0.5568576455116272
    value: 0.28403237462043762
    value: 1.4244365692138672
    value: 1.5974416732788086
    value: -0.63538676500320435
    value: -0.7317357063293457
    value: 1.2366797924041748
    value: 2.0489325523376465
    value: 1.1563291549682617
    value: 1.2585393190383911
    value: 0.61406826972961426
    value: -0.29093503952026367
    value: 0.9238618016242981
    value: -0.53277790546417236
    value: 0.38319385051727295
    value: 0.50919371843338013
    value: -1.2096931934356689
    value: -0.34808230400085449
    value: 1.5498323440551758
    value: 0.28563761711120605
    value: -0.72573447227478027
    value: -0.31549298763275146
    value: -0.13467706739902496
    value: 0.856094241142273
    value: -1.738827109336853
    value: -0.0059363520704209805
    value: -1.0632114410400391
    value: 1.1667147874832153
  }
}
layers {
  layer_name: "43"
  layer_type: "TIDL_ConvolutionLayer"
  bit_depth: 2
  outputs {
    min: 0
    max: 9.71591663
    size: 1
    element_type: 2
    scale: 4155.5546875
    zero_point: 0
  }
  weights {
    min: -0.322647333
    max: 0.404437333
    size: 1
    element_type: 3
    scale: 81021.203125
    zero_point: 0
  }
  bias {
    min: -1.94964814
    max: 2.15518498
    size: 256
    element_type: 0
    scale: 15204.263671875
    zero_point: 0
    value: -0.22853495180606842
    value: 1.2375224828720093
    value: 0.89642983675003052
    value: -0.084525398910045624
    value: -0.35313618183135986
    value: -1.0131149291992188
    value: 0.21544685959815979
    value: -1.375069260597229
    value: -0.41978439688682556
    value: -0.61893826723098755
    value: 0.18438628315925598
    value: 0.18129681050777435
    value: -1.116641640663147
    value: 0.38376373052597046
    value: -0.22662894427776337
    value: -0.481111079454422
    value: 0.40101048350334167
    value: -0.70593678951263428
    value: 0.18558679521083832
    value: -0.67313987016677856
    value: 0.17157304286956787
    value: 0.47710800170898438
    value: 0.21625541150569916
    value: -0.88941109180450439
    value: -0.765834391117096
    value: 0.65011245012283325
    value: -0.56852263212203979
    value: -0.93812090158462524
    value: -0.27946773171424866
    value: 0.43144604563713074
    value: -1.3435513973236084
    value: -0.20792515575885773
    value: 0.2410162091255188
    value: 0.71457159519195557
    value: 0.32120859622955322
    value: 0.45199763774871826
    value: 0.31068694591522217
    value: 0.87629032135009766
    value: -0.88859027624130249
    value: -0.72075426578521729
    value: -0.46122181415557861
    value: 0.72545993328094482
    value: -0.013102452270686626
    value: -0.56455773115158081
    value: -0.40247875452041626
    value: 0.41614735126495361
    value: -0.39590612053871155
    value: 0.63576531410217285
    value: 0.14247088134288788
    value: 0.36452841758728027
    value: -0.10578692704439163
    value: 0.75602304935455322
    value: 1.3774076700210571
    value: -0.838750958442688
    value: 0.5074494481086731
    value: -0.12768997251987457
    value: 0.30801156163215637
    value: 0.66197687387466431
    value: -1.1204103231430054
    value: 0.05255846306681633
    value: -0.68626123666763306
    value: 0.620697021484375
    value: -0.2412680983543396
    value: 0.13585637509822845
    value: -0.0033667986281216145
    value: 0.059124786406755447
    value: -0.19050522148609161
    value: -1.1132781505584717
    value: -1.4531252384185791
    value: -0.38696825504302979
    value: 0.49088644981384277
    value: -0.56327128410339355
    value: -0.38759633898735046
    value: 1.5063073635101318
    value: -0.23398640751838684
    value: -0.89650589227676392
    value: 0.30262881517410278
    value: -0.15531687438488007
    value: 1.7545809745788574
    value: 0.29734677076339722
    value: -0.53111445903778076
    value: -0.17129431664943695
    value: 0.47306665778160095
    value: -0.26149064302444458
    value: 0.37424996495246887
    value: -0.41010761260986328
    value: 0.25848600268363953
    value: 0.22758527100086212
    value: -0.26754510402679443
    value: 0.22679948806762695
    value: -1.2749636173248291
    value: 0.8470083475112915
    value: -1.229828953742981
    value: 0.4338441789150238
    value: -0.62354081869125366
    value: 0.97248518466949463
    value: 0.083555050194263458
    value: -0.96726566553115845
    value: 0.15619108080863953
    value: -0.60020160675048828
    value: 0.42455941438674927
    value: -0.39908400177955627
    value: 0.53985947370529175
    value: 1.2865070104599
    value: -0.4101233184337616
    value: -1.5390121936798096
    value: -0.42232078313827515
    value: -0.83875548839569092
    value: -0.45749872922897339
    value: 0.15071772038936615
    value: 0.29477411508560181
    value: -0.30278253555297852
    value: -0.44621658325195312
    value: 0.993398129940033
    value: 1.4744918346405029
    value: -1.5556252002716064
    value: -0.66525554656982422
    value: -0.18988044559955597
    value: -0.591054379940033
    value: 0.29841116070747375
    value: -1.3660509586334229
    value: -0.65611565113067627
    value: 0.4309639036655426
    value: 0.17803755402565002
    value: -0.34327709674835205
    value: 0.87290662527084351
    value: 0.176075279712677
    value: 1.7110656499862671
    value: -1.7390453815460205
    value: 0.52237015962600708
    value: 0.11639227718114853
    value: -0.96412855386734009
    value: -0.57804161310195923
    value: -0.34089070558547974
    value: 0.10219910740852356
    value: 0.22845073044300079
    value: -0.37346875667572021
    value: -1.2090388536453247
    value: -0.14139576256275177
    value: -0.037070855498313904
    value: 0.18357397615909576
    value: -0.48105287551879883
    value: -0.49151507019996643
    value: -0.43277761340141296
    value: 0.29083457589149475
    value: -0.07611682265996933
    value: -0.28326889872550964
    value: -0.60755419731140137
    value: -0.44000899791717529
    value: 0.42129963636398315
    value: 0.12243420630693436
    value: -0.32621067762374878
    value: -0.46284475922584534
    value: -0.20653107762336731
    value: -0.99820113182067871
    value: 0.77630579471588135
    value: -0.60447061061859131
    value: -1.62466299533844
    value: 0.0583966001868248
    value: 0.46554595232009888
    value: -0.34966504573822021
    value: 0.12474559247493744
    value: 0.36631619930267334
    value: -0.2360415905714035
    value: -0.547581136226654
    value: 0.71821212768554688
    value: 0.38475731015205383
    value: 0.1965981125831604
    value: 0.042496290057897568
    value: 0.0960598811507225
    value: -0.34417229890823364
    value: -1.7493371963500977
    value: -0.19107581675052643
    value: -0.30861905217170715
    value: 0.87193334102630615
    value: 0.60298043489456177
    value: -0.45142170786857605
    value: 1.0269057750701904
    value: 0.5493471622467041
    value: -0.52698951959609985
    value: 0.12646898627281189
    value: -0.13824769854545593
    value: 0.10171360522508621
    value: -1.6293375492095947
    value: -0.55297833681106567
    value: 0.23332279920578003
    value: -1.1747895479202271
    value: -0.20317849516868591
    value: 0.68339329957962036
    value: 0.58046597242355347
    value: -0.32895404100418091
    value: -0.70722758769989014
    value: -0.87625235319137573
    value: -1.4292635917663574
    value: -0.97650498151779175
    value: -0.64715009927749634
    value: -0.54767286777496338
    value: -1.4283211231231689
    value: -1.2922046184539795
    value: -1.9496481418609619
    value: -0.5822257399559021
    value: 0.47792571783065796
    value: -0.52290952205657959
    value: 0.050390828400850296
    value: -0.569854199886322
    value: 0.36229246854782104
